[
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Friends Don't Allow Friends to Destroy Lives With Drugs",
            "text": "i have a serious problem with my best friend. \"jennifer\" and i used to tell each other everything, and i thought our friendship would be forever. but recently i have not been able to understand her at all.\njennifer has started using drugs. i knew she was smoking pot, but she had promised me she wouldn't do anything heavier. now i know she was lying to me. i've tried to get her to quit, but it's getting worse every day. we argue a lot and sometimes she swears at me. (she never did that before she was on drugs.)\nwe are students, and i can't study because i'm so worried about her.\ntwo weeks ago i decided i couldn't stand it any more and made a decision to stay away from her. i still would like to be jennifer's friend because i remember what a sweet girl she used to be. but now i don't know if i even like her. even though i feel freedom after separating from her, i worry that maybe i'm making her life worse by not being there for her when she needs me.\nabby, should i still be a friend of hers or not? -- confused in california"
        },
        "statistics": {
            "word_count": 204,
            "flesch_score": 83.96,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 9,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1997,
            "url": "http://www.uexpress.com/dearabby/1997/3/9",
            "portrait_id": 2001
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "SPORTING HUSBAND NOT GAME FOR MARRIAGE; GET HELP QUICK",
            "text": "my problem is growing, and i am going crazy. my husband pursues the following throughout the year: hunting, fishing, football, basketball, baseball, golf, softball (two teams) and bowling!\ni am home with two children. one is 3 1/2; the baby is 5 months old. some of my friends say, \"go to work; you've got to get out of the house and do your own thing.\" wrong! i tried it when my firstborn was a year old. i worked as a secretary for peanuts, came home dead tired and had to do 90 percent of the work at home because either my husband wasn't home or he was watching sports on tv.\nthank god he doesn't drink or chase other women. he does bring home a good paycheck, but i'm tired of being ignored while he's away at a game or participating in one.\ni hate to give him an ultimatum, but i have such deep resentment building up inside me. what should i do? married with no husband."
        },
        "statistics": {
            "word_count": 168,
            "flesch_score": 82.65,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1986,
            "url": "proquest",
            "portrait_id": 2002
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "HERE'S THE RIGHT WAY TO MEET MEN",
            "text": "i am going with a very nice man i met on a street corner. you probably won't believe this, but i was lost and this nice-looking, well- dressed man approached me and asked if he could help me. i told him my plight and he walked me to where i was going, and that's how we got acquainted.\nwhen people ask how we met, i'm embarrassed to say i just met him on a street corner. it just doesn't sound right.\nabby, what if you meet a person in a restaurant? would you call that a \"pickup\"? how about getting acquainted in a library? (that has a little higher-class ring to it.) meeting someone in a bar sounds rather cheap, but some nice people go to bars alone and don't mind if someone strikes up a conversation with them.\ni avoid eye contact with people i pass in a park, especially if they're walking slowly, or like they're just killing time.\ni think you get the idea. what's ok and what isn't? friendly, but confused"
        },
        "statistics": {
            "word_count": 175,
            "flesch_score": 92.63,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Tradition"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1988,
            "url": "proquest",
            "portrait_id": 2006
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Eager Little Leaguers Suffer Major League Disappointment",
            "text": "my husband, \"greg,\" and i dated five years before we married two years ago. greg is catholic and i am southern baptist. his family was aware of our religious differences from the beginning. we were completely candid that neither of us would convert from our religions, and that our children would be raised baptist until they were old enough to decide otherwise.\non our wedding day, no one from greg's family showed up, and i watched tears stream down my husband's face on what should have been the happiest day of his life. it has been very difficult ever since. his parents christened our child at their home without greg's or my consent. there have been other problems -- too numerous to mention.\nthe last straw came three months ago. greg's older sibling was also married in a non-catholic church. this time, the entire family, including us, attended.\nthe problem with greg's parents has caused a major strain on our marriage. we have invited them over on numerous occasions to hash out our differences, but they have never showed up. after our last attempt, they said they had nothing else to talk to us about.\nabby, i feel no love lost because of their absence, and my toddler really doesn't know them anyway. however, i am concerned about my husband's feelings. he and my child mean the world to me. i don't want my marriage to suffer. i'm worried that if this continues much longer, i'll lose my temper with the situation. can you help us? -- losing my cool in georgia"
        },
        "statistics": {
            "word_count": 262,
            "flesch_score": 75.81,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Tradition"
                ]
            }
        },
        "extra": {
            "letterId": 2,
            "year": 1997,
            "url": "http://www.uexpress.com/dearabby/1997/11/4",
            "portrait_id": 2008
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Fireworks on the Fourth Are Best Enjoyed From a Distance",
            "text": "my husband and i have a 29-year-old daughter who is married and has two small children.\nwhen she turned 17, she went to israel and slowly became orthodox jewish. she married a guy just like her. my husband and i are jewish but not religious; however, i accepted her new way of life even though we continue to live our own way of life.\nmy problem is my husband. he says that she went against his wishes, and she should have considered his opinion. he expects me to minimize my visits, saying we are married and should \"work as a team.\"\nabby, religious or not religious, my grandchildren are my life. i will never stop seeing them or loving them. i think my husband needs to hear other people's views. would you care to comment? -- jane in new york"
        },
        "statistics": {
            "word_count": 140,
            "flesch_score": 85.08,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Tradition",
                    "Benevolence",
                    "Universalism",
                    "Conformity",
                    "Security",
                    "Power",
                    "Achievement"
                ]
            }
        },
        "extra": {
            "letterId": 2,
            "year": 2000,
            "url": "http://www.uexpress.com/dearabby/2000/6/30",
            "portrait_id": 2009
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Man of Her Dreams Refuses to Make Marriage a Reality",
            "text": "i am a 45-year-old divorced mother of three.\n\"jeff,\" the man i am seeing, is kind, patient, understanding\nand generous. he is a gentleman. there isn't anything i want\nor wish for that he does not get for me. jeff sends me\nflowers several times a month. he loves my children dearly. i\ncould not ask for a more perfect man.\nthe problem is: he's still married. jeff and his wife\nhave been separated for 10 years. he refuses to see a lawyer,\neven for consultation, because he says he can't afford a\ndivorce. he's convinced his wife will take \"everything.\" how\ncan he be certain if he doesn't talk to someone?\ni love jeff with all my heart, but quite frankly, i am\ntired of waiting. i want to be his wife. i know jeff loves me\nwith all his heart, mind, body and soul -- but maybe not\nenough to get married.\nabby, how much longer do i wait? -- everything except\nthe ring"
        },
        "statistics": {
            "word_count": 166,
            "flesch_score": 87.11,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 2001,
            "url": "http://www.uexpress.com/dearabby/2001/6/1",
            "portrait_id": 2011
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Husband Demanding Attention Interferes With Sisterly Chat",
            "text": "i am 16 years old and having trouble finding a way to tell my parents that i'm a lesbian. every day i wish i could find the courage to say, \"mom, dad, i'm gay!\" but it's a lot more complicated than that. they are very religious, and i have seen firsthand how they react to homosexuality. that's why it's going to be so hard to break the news. i don't want to tell them, but i know that i have to in order to get on with my life. what should i do? -- trapped in georgia"
        },
        "statistics": {
            "word_count": 97,
            "flesch_score": 93.14,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 2,
            "year": 2002,
            "url": "http://www.uexpress.com/dearabby/2002/7/5",
            "portrait_id": 2012
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "'Only' Child Finally Discovers Half Sisters She Never Knew",
            "text": "i am an only child. four years ago, when i was 19, i lost my father to cancer. recently i was sorting through some of dad's papers and found an old will. it said something to the effect that \"i, michael, am the father of sarah and anne, both from a previous marriage. when i refer to 'my daughter,' in the remainder of the will, i am speaking only of 'kelly.'\" (that's me.) i was floored. i have two older half-sisters i was never told about! growing up, i hated being an only child and begged my parents to have more children.\ni do not believe my father was a \"deadbeat dad,\" because he always spoke harshly about individuals who didn't pay child support. he traveled the world in the military and lived in many countries and states before he met my mother.\nabby, i am afraid to confront my mother. i know i shouldn't have snooped through my father's old papers, but i feel i had the right to know i have two half-siblings. what do i do now? -- not my father's only precious girl"
        },
        "statistics": {
            "word_count": 187,
            "flesch_score": 83.36,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Security",
                    "Conformity",
                    "Tradition",
                    "Benevolence",
                    "Universalism",
                    "Power",
                    "Achievement"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 2003,
            "url": "http://www.uexpress.com/dearabby/2003/11/1",
            "portrait_id": 2014
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Five Year Olds Girls Should Not Be Walking Home Alone",
            "text": "last february, my husband suffered an anoxic brain injury -- lack of oxygen to the brain. needless to say, he is no longer the man he was.\nour friends have all disappeared. they tell me it's hard for them to see him like this. how do they think i feel?\nam i wrong to feel hurt? i don't understand why they can't even call. talking has always been an outlet for me, but no one ever calls me anymore. no one knows how someone else feels until they've been there, but what happened to, \"i'll be there for you,\" or \"call if you need me\"? i wouldn't ask them for anything but conversation.\nis it normal for people to avoid friends when they are in trouble or pain? -- friendless in georgia"
        },
        "statistics": {
            "word_count": 132,
            "flesch_score": 94.35,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 2,
            "year": 2004,
            "url": "http://www.uexpress.com/dearabby/2004/2/19",
            "portrait_id": 2018
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Son Learns Mom Is Stepping Out on Dad While He's in Jail",
            "text": "my father went to prison five years ago, and my mother has been taking care of my brother and sister. (i'm older and out of the house.)\ni recently came across some shocking information. mom has been going on dates with a clergy member who has been sending her text messages saying things like \"i can't stop thinking about you,\" etc. i also found out she has a profile on a couple of internet dating sites and has been coming home later than usual after going out \"for drinks with friends\" after work. when i confronted her, she first denied it, then got caught in a lie. she refuses to accept responsibility, insisting \"it wasn't a date,\" although this man expressed romantic feelings for her.\nmy father knows nothing about this while he languishes in a cell for what could be another five or six years. should i tell him? i also do not know if i should confront this clergyman because i find his actions despicable.\nhow can i explain to my mother that what she's doing is wrong? when i try to talk to her in a mature way, she says things like, \"i can't hear you!\" any advice you can offer would be appreciated. -- disillusioned son in new jersey"
        },
        "statistics": {
            "word_count": 213,
            "flesch_score": 73.07,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 2005,
            "url": "http://www.uexpress.com/dearabby/2005/12/11",
            "portrait_id": 2019
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Woman Wonders if It Is Ok to Settle for Mr. Almost Right",
            "text": "some new neighbors moved into our beautiful neighborhood recently. this couple, who seem very nice, have gotten an adorable puppy i'll call \"taffy.\"\ntaffy is now about 6 months old. they leave her in front of their house, completely alone, for most of the day and all night. from what we can see, that poor dog is never allowed inside. taffy craves affection, and we all stop to pet her whenever we go by the house, just to allay some of her loneliness and boredom.\nhow should we deal with this painful situation? do we dare say anything to the owners -- which will obviously cause \"neighbor difficulties\"? please advise. -- sally in san diego"
        },
        "statistics": {
            "word_count": 115,
            "flesch_score": 84.07,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 3,
            "year": 2007,
            "url": "http://www.uexpress.com/dearabby/2007/12/30",
            "portrait_id": 2021
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Alcoholic Husband's Suicide Continues to Haunt His Wife",
            "text": "can you go to al-anon if you had a husband who was an alcoholic, but is dead? he committed suicide with a 5.0 blood alcohol level.\ni have been a mess for the last two years. i can't sleep, can't concentrate and don't enjoy anything. i would really like to be able to talk with people who understand what living with an alcoholic is like and won't blame me for what he did, as most of his family does. but i hesitate to go to al-anon.\nwhat can i do to get over the self-inflicted death of a man i'll never stop loving? -- hurting in houston"
        },
        "statistics": {
            "word_count": 107,
            "flesch_score": 84.88,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 2007,
            "url": "http://www.uexpress.com/dearabby/2007/7/30",
            "portrait_id": 2022
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Cold Hearted Comment Turns Bedroom Into Deep Freeze",
            "text": "my 12-year-old niece, \"amanda,\" is on her cell phone constantly. she is the smartest kid i know, but she is failing her classes and has started to lie about everything. i raised her until she was 5 -- i was only 12 myself when i started -- so i am very close to her. or so i thought.\namanda lives with her dad and stepmom, who are doing their best to raise her, but nothing is working. when she was growing up she never lied, and i mean never. i have told her not to be afraid to talk to me about anything, but she hasn't, and it hurts me that she can't come to me. what do you suggest i do? -- worried aunt in washington"
        },
        "statistics": {
            "word_count": 127,
            "flesch_score": 91.31,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 3,
            "year": 2010,
            "url": "http://www.uexpress.com/dearabby/2010/8/11",
            "portrait_id": 2025
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Mother in Law's Scanty Clothes Get Dressing Down From Wife",
            "text": "my husband, \"joe,\" and i have been married for 12 years. i have a daughter from a previous marriage and he has a son from a previous relationship. my daughter is married and lives in another state.\nmy 22-year-old stepson, \"junior,\" lives with us. he has a history of drug and alcohol abuse and has stolen from us. i recently discovered that another item of mine was missing. i told joe it has to stop -- that i can't live like a prisoner in my own home. joe will not kick junior out of the house. joe said he would leave, but that he won't put junior out on the street like a dog.\nour marriage was solid until junior's problems started a year ago. i'd never ask my husband to make a choice. junior is his son. i, on the other hand, feel like a stranger in my own home. we barely speak now and have been sleeping in separate rooms. i am at a loss. abby, have you any advice? -- stranger in my own home"
        },
        "statistics": {
            "word_count": 178,
            "flesch_score": 86.3,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 2,
            "year": 2011,
            "url": "http://www.uexpress.com/dearabby/2011/12/14",
            "portrait_id": 2028
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Young Man Wanders Adrift in Sea of Confused Emotions",
            "text": "i'm a 21-year-old male who feels lost and unfulfilled, and it's because i don't know what i want or deserve. i am one of three adopted children. i was the child who always needed the family support system the most. i come from a not-so-happy family, one with all its priorities centered around money. (or, more accurately, lack of money.) i never felt the love a child should feel from his family.\nmy problem these days is my alcohol intake. i can't stay away from beer. i drink to forget my family problems and the fact that i can't seem to get anything right.\ni dropped out of college because i don't have a passion for anything or anyone. i used to have hobbies -- like writing, photography, etc. -- but the beer has taken away my motivation and creativity.\ni feel i'm losing my will to keep trying. i want so badly to keep trying, but my emotions are keeping me down. i just want something new, something i can give my all to, something that won't hurt me in the future. -- what can i do?"
        },
        "statistics": {
            "word_count": 188,
            "flesch_score": 76.62,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Security",
                    "Benevolence",
                    "Universalism",
                    "Conformity"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 2011,
            "url": "http://www.uexpress.com/dearabby/2011/4/5",
            "portrait_id": 2030
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "Daughter Acts Like a Winner, but Still Feels Like a Loser",
            "text": "i'm a 27-year-old woman who still lives at home. i do it so i can help my mom with my five nieces and nephews. their mother passed away suddenly in 2009 at the age of 30. my mom and stepdad kept them rather than scatter them to fathers who don't appear very interested in them.\nsince my sister's death i have earned two degrees, entered the health care field and have lost almost 140 pounds. despite what i have accomplished, i feel i have nothing to show for myself. when i point my accomplishments out to myself, they don't seem like a heck of a lot. what can i do so i can stop feeling like a loser? -- lost in the northeast"
        },
        "statistics": {
            "word_count": 123,
            "flesch_score": 91.51,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 8,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 2014,
            "url": "http://www.uexpress.com/dearabby/2014/1/30",
            "portrait_id": 2034
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "CON MAN HIDES NAME, ADDRESS TO DEFRAUD PEN PAL",
            "text": "about a month ago, we lost our beloved pet. she had been a constant companion and friend for 13 years. i can't believe how her death has affected me. most people have a very hard time understanding that she was as much a part of my life and family as my husband and children, and i grieve for her as i would for any family member.\ni feel as though i may need some sort of counseling, but i don't know where to turn. i'm having a difficult time getting on with my life. i feel heartsick and depressed. some mornings i don't even want to get out of bed.\nwe have other pets, and though we love them very much, none can take her place.\ncan you help me, please?\ngrief-stricken"
        },
        "statistics": {
            "word_count": 132,
            "flesch_score": 91.92,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Security",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1985,
            "url": "proquest",
            "portrait_id": 2038
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "SUCH CHARITY IS MISDIRECTED",
            "text": "i am to be married soon and have a very serious problem to face. my fiance's father is seriously ill. (he's terminal.) the doctors have just given him a period of time to live, which comes very close to our wedding date. we set our wedding date four months ago--before we knew how sick he was.\nif he is called by god close to our wedding date, what is the proper etiquette with regard to our wedding? how can we handle the joy of our wedding with the sorrow of his passing, which will be mourned by my fiance's mother and the rest of his family?\nplease answer soon as there isn't much time. happy and sad"
        },
        "statistics": {
            "word_count": 117,
            "flesch_score": 82.04,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Benevolence",
                    "Universalism",
                    "Security",
                    "Tradition",
                    "Conformity",
                    "Achievement",
                    "Hedonism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1986,
            "url": "proquest",
            "portrait_id": 2041
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "BIGOTRY SHOULD NEVER BE TOLERATED",
            "text": "my husband and i recently had five couples to our home for dinner. the dinner was delicious--everyone raved. but immediately after the dessert, one of the guests asked for a newspaper to check the movie listings.\nbefore we knew it, four couples were putting on their coats and running out the door so they wouldn't be late for the movie. i will say in their defense that they invited my husband and me to join them, but we declined.\nwhat do you think of such people? too sensitive in n. y."
        },
        "statistics": {
            "word_count": 91,
            "flesch_score": 83.66,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Security",
                    "Conformity",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1987,
            "url": "proquest",
            "portrait_id": 2044
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "ALCOHOLIC'S PLIGHT UPSETS STRANGER",
            "text": "i placed an ad in our local lincoln paper to \"drive your car to any destination for a fee.\" this morning a lady called, wanting me to drive her to a retirement home in texas. after the price was agreed upon, i went to her apartment in lincoln.\nwhen she met me at the door she was crying, saying she was an alcoholic --and a very sick woman--and could i please help her. the poor woman was shaking, so i suggested we call a family member as i had never seen this lady before in my life. (there is alcoholism in my family, so my heart went out to her.) she said she was 69, but she looked much older. she started shaking badly, and began looking for her bottle. (she had bottles hidden all over the place, but the ones i found were empty!) we visited for half an hour, then she fell asleep on the couch, so i called the apartment manager who turned out to be a young lady about 35. she said, \"leave her alone; don't get involved. go on home.\"\ni went home, but, abby, this poor lady has called me five times asking me to come back. part of me says, \"go back and try to help her,\" and the other half says, \"listen to the manager--don't get involved.\"\ni feel guilty because like most people, i don't want to get involved, but i can't get this lady out of my mind. she said she has no family. what would you do in a case like this? w.f., palmyra, neb."
        },
        "statistics": {
            "word_count": 266,
            "flesch_score": 89.48,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Benevolence",
                    "Universalism",
                    "Stimulation",
                    "Achievement",
                    "Conformity",
                    "Tradition",
                    "Security"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1987,
            "url": "proquest",
            "portrait_id": 2045
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "KIDS IN THIRD PLACE WITH GRANDMA",
            "text": "our son is 3 years old. our daughter is 5. my parents live an hour away-by car. i recently phoned and asked them to come and stay with their grandchildren for a weekend while we attend a convention in another city.\nmy mother immediately checked to see if the dates (two months away) were on their \"rv group\" weekend. since we so rarely ask them to baby-sit, and the children love \"nini and papa\" so much, i was hurt, and wrote and told them so.\nmother wrote back, listing her priorities as follows: (1) her job. (she sells real estate.) (2) her favorite activity. (taking rv group trips with her husband, who is retired.) (3) her grandchildren.\nneedless to say, i engaged a baby sitter. my parents are now saying that we should understand their need for freedom. abby, they have stayed with our children overnight only once in a year and a half, when we delivered the kids- never have they driven to our home to baby-sit for the evening.\nwe have decided never again to ask them for anything. are we right or wrong to feel as we do? third place but no show"
        },
        "statistics": {
            "word_count": 196,
            "flesch_score": 85.18,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1987,
            "url": "proquest",
            "portrait_id": 2047
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "HALF-TRUTHS TELL THE WHOLE STORY",
            "text": "i need your advice about something-sales clerks. i can't stand them! they aggravate me beyond belief. sometimes i even leave the store if they really get to me. i try not to ask for their help because when i do, they stick to me like glue until i leave the store. if i go to try something on, they will be waiting for me to tell me how good i look.\nabby, when i try something on, i like to look at it alone and think about buying it, not feel like i'm pressured for time to get out of the change room. if sales clerks want to sell something, they have to give the customer space and privacy.\nin the meantime, do you know of a way to tell these salespeople that their help is appreciated, but you would like to be left alone? sign me ... too much attention"
        },
        "statistics": {
            "word_count": 151,
            "flesch_score": 90.09,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Security",
                    "Conformity",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1988,
            "url": "proquest",
            "portrait_id": 2050
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "MOM UPSET BY NEW PART-TIME ROLE",
            "text": "during the past 10 years, i have raised four children. the last two are twins. as the school year begins, i see my babies going off to school full time. what happens now?\nwe can't wait until our children say their first words, take their first steps, are finally out of diapers, and then-boom, they are off to kindergarten!\ni actually looked forward to their being in school all day, but now that it has happened, i am lost. i don't know what to do with myself. i ask myself if i should take up a hobby or get a job. or perhaps have another baby?\nam i crazy for feeling this way? are there others out there who have felt this way? brentwood, n.y., mom"
        },
        "statistics": {
            "word_count": 126,
            "flesch_score": 93.64,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1988,
            "url": "proquest",
            "portrait_id": 2053
        }
    },
    {
        "data_source": "DearAbby",
        "content": {
            "title": "19-year-old resents house rules",
            "text": "i am 18 years old and consider myself a man. i work full time, live with my parents and pay room and board. my question: shouldn't i be allowed to have my girlfriend sleep over in my room? she's 19 and my one and only girlfriend.\ni believe that since i am paying for this room and am of age, i should be able to have overnight company here if i want to. my parents disagree. they think i should live by the house rules they set before i turned 18. i always respected their rules and never complained.\ni love my parents and enjoy living with them, but think they should not put any restrictions on what i can do in my room as long as i am paying rent. what do you think? must i move out to avoid a hassle? this is the only thing we ever argue about. a man with little boy rules"
        },
        "statistics": {
            "word_count": 158,
            "flesch_score": 92.93,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Achievement",
                    "Power",
                    "Security",
                    "Conformity",
                    "Tradition",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "letterId": 1,
            "year": 1989,
            "url": "proquest",
            "portrait_id": 2056
        }
    }
]