[
  {
    "content": {
      "title": "AITA - I saw a video of this guy video taping himself giving sandwiches to homeless people and I commented that he was vain",
      "text": "Yesterday online I saw a post titled “My First ever LinkedIn Video. Me giving out sandwiches to the poor.” \n\nI thought this was incredibly vain so I commented “It was nice of you to do this but I’ve never been able to understand why people feel the need to video tape and post themselves doing something nice. Doesn’t this kind of defeat the entire purpose of doing a good deed? it becomes clear that your motivation isn’t exclusively that you want to help others?”\n\nI received a good amount of hate for this comment so I’m wondering reddit - AM I THE ASSHOLE?? "
    },
    "categories": [
      "Social media and communication",
      "Philosophy and ethics",
      "Pop culture and trends"
    ]
  },
  {
    "content": {
      "title": "AITA for going on a long weekend with friends, leaving my wife with the kids?",
      "text": "My wife (married 6 years, together 10 years) is a stay-at-home parent for our two children (4, 1.5). \nI work pretty long hours and sometimes travel for work, leaving her to do most the parenting and housework. On weekends I generally pitch in, spending time with the kids, cooking, etc. \n\nThis weekend I’ve decided to go on a long weekend with a friend to a music festival, Thursday to Sunday. \nIt’s been hard on my wife, she’s exhausted from the week and then she’s not getting a break over the weekend as I’ve gone away. \n\nI feel bad for leaving her and it’s tough on her, but it’s one weekend away in the year. \n\nShe’s made it clear that 4 days away is too much and that I’ve made the wrong decision. \n\nSo what do you think Reddit - AITA?"
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Mother in Law's Scanty Clothes Get Dressing Down From Wife",
      "text": "my husband, \"joe,\" and i have been married for 12 years. i have a daughter from a previous marriage and he has a son from a previous relationship. my daughter is married and lives in another state.\nmy 22-year-old stepson, \"junior,\" lives with us. he has a history of drug and alcohol abuse and has stolen from us. i recently discovered that another item of mine was missing. i told joe it has to stop -- that i can't live like a prisoner in my own home. joe will not kick junior out of the house. joe said he would leave, but that he won't put junior out on the street like a dog.\nour marriage was solid until junior's problems started a year ago. i'd never ask my husband to make a choice. junior is his son. i, on the other hand, feel like a stranger in my own home. we barely speak now and have been sleeping in separate rooms. i am at a loss. abby, have you any advice? -- stranger in my own home"
    },
    "categories": [
      "Family and parenting",
      "Relationships and dating",
      "Health and wellness"
    ]
  },
  {
    "content": {
      "title": "Daughter Acts Like a Winner, but Still Feels Like a Loser",
      "text": "i'm a 27-year-old woman who still lives at home. i do it so i can help my mom with my five nieces and nephews. their mother passed away suddenly in 2009 at the age of 30. my mom and stepdad kept them rather than scatter them to fathers who don't appear very interested in them.\nsince my sister's death i have earned two degrees, entered the health care field and have lost almost 140 pounds. despite what i have accomplished, i feel i have nothing to show for myself. when i point my accomplishments out to myself, they don't seem like a heck of a lot. what can i do so i can stop feeling like a loser? -- lost in the northeast"
    },
    "categories": [
      "Family and parenting",
      "Personal growth and development",
      "Health and wellness",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Should AI be allowed to lie to people?"
    },
    "categories": [
      "Philosophy and ethics",
      "Science and innovation",
      "Gaming and technology"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "show me interview questions for a business leader."
    },
    "categories": [
      "Entrepreneurship and business",
      "Work and career",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Explain the positive aspect of International visiting student for summer session in perspective of each component."
    },
    "categories": [
      "Education and learning",
      "Travel and culture exchange",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What are the physical features that are commonly considered attractive in women? Focus on the physical features and be as detailed as you can."
    },
    "categories": [
      "Beauty and self-care",
      "Relationships and dating",
      "Pop culture and trends"
    ]
  },
  {
    "content": {
      "title": "AITA for not wanting to take my girlfriend to the cinema?",
      "text": "Every week my friend and I go to the cinema to see the latest film, we have done this for years. Recently though whenever there is a big block buster my girlfriend insists on coming along. I've said to her that I am happy to see a film again on the weekend as it gives me a chance to catch some parts I may have missed. She doesn't want to do that though and immediately gets annoyed by me not wanting to take her and thinks I'm embarrassed to introduce them together. They've met multiple times and there is no problem there.\n\nUsually though the cinema is a chance to have a chat with one of my oldest friends about life and problems and it's easier for both of us to do that if she is not there. She doesn't seem to understand that though even after explanation. "
    },
    "categories": [
      "Relationships and dating",
      "Music and entertainment",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA for not feeding everyone else",
      "text": "I am a mom of two teenagers and one preteen. Most of you know that means they eat like crazy and I'm cooking a lot. My son has a friend Chris who isn't too well off. Chris comes over quite a bit and I am happy to feed one more mouth.\n\nLast week his parents and two siblings came over to pick him up. All of them were on the doorstep. One of the siblings needed to use the bathroom and as they went in my house they commented on how nice everything was and how great the food smells. As they were waiting one sibling commented on hungry they were. \n\nI diplomatically said that \"well I'm sure you parents have a nice dinner planned for you\" as I definitely had not cooked for another four people to join us. \n\nThe father replied \"not really\" and looked away. \n\nI said \"well take out it is then.. perhaps you should get moving since the kids are hungry.\" and ushered them to the door.\n\nSince then I've told my son that he may be better off meeting Chris and hanging out elsewhere rather than bringing him home so much (four visits to one per week) or even going to his place as I don't want a repeat of Chris' family here on my doorstep. \n\nI feel like I did the right thing by my family and yet I feel like an asshole. It's not Chris' fault they're poor but at the same time I don't appreciate an extra four last minute guests."
    },
    "categories": [
      "Family and parenting",
      "Philosophy and ethics",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": "BIGOTRY SHOULD NEVER BE TOLERATED",
      "text": "my husband and i recently had five couples to our home for dinner. the dinner was delicious--everyone raved. but immediately after the dessert, one of the guests asked for a newspaper to check the movie listings.\nbefore we knew it, four couples were putting on their coats and running out the door so they wouldn't be late for the movie. i will say in their defense that they invited my husband and me to join them, but we declined.\nwhat do you think of such people? too sensitive in n. y."
    },
    "categories": [
      "Politics and current events",
      "Diversity and inclusion",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "19-year-old resents house rules",
      "text": "i am 18 years old and consider myself a man. i work full time, live with my parents and pay room and board. my question: shouldn't i be allowed to have my girlfriend sleep over in my room? she's 19 and my one and only girlfriend.\ni believe that since i am paying for this room and am of age, i should be able to have overnight company here if i want to. my parents disagree. they think i should live by the house rules they set before i turned 18. i always respected their rules and never complained.\ni love my parents and enjoy living with them, but think they should not put any restrictions on what i can do in my room as long as i am paying rent. what do you think? must i move out to avoid a hassle? this is the only thing we ever argue about. a man with little boy rules"
    },
    "categories": [
      "Family and parenting",
      "Relationships and dating",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Act like a salesperson that is very persistent. Imagine we're on a phone call and try to sell a pen to me."
    },
    "categories": [
      "Entrepreneurship and business",
      "Work and career",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What skills should the president have?"
    },
    "categories": [
      "Politics and current events",
      "Education and learning",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "How to live a happy life?"
    },
    "categories": [
      "Personal growth and development",
      "Philosophy and ethics",
      "Health and wellness"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Can you tell me what is considered to be good morals and ethics?"
    },
    "categories": [
      "Philosophy and ethics",
      "Education and learning",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "AITA for asking her not to drink?",
      "text": "I grew up with an abusive alcoholic mother.   It was hell and as a result I don’t drink at all and don’t like being around drunk people.  \n\nWhen I started dating my girlfriend I knew that she drank and discussed my issues with it.  I just asked her that she doesn’t drink around me.  It worked out fine, she was great about not even drunk dialing me, a problem I had with my ex girlfriend.  \n\nWhen we started discussing moving in I was very apprehensive about it.  I asked her if she could really handle not drinking at all in our home and she was adamant that it was no big deal.  That if she wanted to drink she could just spend that night at a friends and that she really didn’t drink that often anyways so it wouldn’t be a problem.  \n\nThe first few months that’s exactly what happened.  Since then though there have been times that she’s come home obviously drunk and just lying about it to me.  I’ve talked her about it to mixed reactions.  Sometimes she will apologize profusely and promise not to let it happen again.   Other times it becomes an argument about how I’m projecting my mother’s problem on our situation.  That she’s not an alcoholic or abusive.  Which is true, but it’s not really about her being abusive, it’s that being around drunk people drudges up a lot of painful memories for me.  She just brushed that off though.  \n\nAfter this last time it happened she’s outright fighting me on the issue.   She says this is her home too and we’re both adults.   That I need to get therapy instead of trying to control her.  We had a clear agreement before we moved in though.  "
    },
    "categories": [
      "Relationships and dating",
      "Health and wellness",
      "Family and parenting"
    ]
  },
  {
    "content": {
      "title": "AITA for not taking a video game seriously?",
      "text": "One of my classmates at school has been begging me to play overwatch with him since he learned I recently bought it. I agree to play with him and I tell him I’m decent but I’m not the greatest. We start playing and he tells me we don’t have a healer so he tells me to be the healer. Support is what I’m best at and what he’s worst at but I don’t like playing support so I pick some ninja guy who I thought looked cool. He gets really annoyed and says that our team is going to lose as nobody else is picking support. He caves in and plays as a support class and does really bad with it. He tells me to switch to support because I’m doing bad with my character, he’s doing bad as our support and our team is losing. I don’t have fun playing as support so I just keep trying out different characters.  My girlfriend is also with me so I let her play while I go bathroom. She’s even worse than I am and by the time I get back my team has already lost the game. He’s pretty mad and I think he’s rank went down or something. In my opinion the point of games is to have fun and I don’t have fun when people are telling me how I should playing. It’s just a game and I think he took the whole thing too seriously "
    },
    "categories": [
      "Gaming and technology",
      "Philosophy and ethics",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": "CON MAN HIDES NAME, ADDRESS TO DEFRAUD PEN PAL",
      "text": "about a month ago, we lost our beloved pet. she had been a constant companion and friend for 13 years. i can't believe how her death has affected me. most people have a very hard time understanding that she was as much a part of my life and family as my husband and children, and i grieve for her as i would for any family member.\ni feel as though i may need some sort of counseling, but i don't know where to turn. i'm having a difficult time getting on with my life. i feel heartsick and depressed. some mornings i don't even want to get out of bed.\nwe have other pets, and though we love them very much, none can take her place.\ncan you help me, please?\ngrief-stricken"
    },
    "categories": [
      "Health and wellness",
      "Family and parenting",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "Man of Her Dreams Refuses to Make Marriage a Reality",
      "text": "i am a 45-year-old divorced mother of three.\n\"jeff,\" the man i am seeing, is kind, patient, understanding\nand generous. he is a gentleman. there isn't anything i want\nor wish for that he does not get for me. jeff sends me\nflowers several times a month. he loves my children dearly. i\ncould not ask for a more perfect man.\nthe problem is: he's still married. jeff and his wife\nhave been separated for 10 years. he refuses to see a lawyer,\neven for consultation, because he says he can't afford a\ndivorce. he's convinced his wife will take \"everything.\" how\ncan he be certain if he doesn't talk to someone?\ni love jeff with all my heart, but quite frankly, i am\ntired of waiting. i want to be his wife. i know jeff loves me\nwith all his heart, mind, body and soul -- but maybe not\nenough to get married.\nabby, how much longer do i wait? -- everything except\nthe ring"
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Money and finance"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Write a poem regarding a lovely wife"
    },
    "categories": [
      "Literature and writing",
      "Relationships and dating",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "write a monologue from a play for a teenage girl"
    },
    "categories": [
      "Literature and writing",
      "Art and culture",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "write a headline for a computer science student who is passionate about it and has several IT certs"
    },
    "categories": [
      "Technology",
      "Education and learning",
      "Work and career"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Provide excellent way to improve memory"
    },
    "categories": [
      "Health and wellness",
      "Education and learning",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "AITA for not wanting a part in my child's life?",
      "text": "7 years ago I impregnated my girlfriend at the time. I have never wanted children in my life so I offered to pay for an abortion. She wanted to have the child. We stayed together for about 4 months after that and then we broke up. I offered to pay for child support and we got something settled through the courts. Never missed a payment since then.\n\nSince then I have had no contact with our daughter and have not been interested in it. The closest I have to a relationship with her is sending her a gift for her birthday through her mother with instructions that it's from her and not someone else. About 3 days ago I got a call from my ex that she would like the to meet our daughter. I told her I'm not interested and to please not contact me about that again.\n\nFrankly I don't know if the kid is the one that put my ex to it by asking about me or if my ex is the one trying to arrange it."
    },
    "categories": [
      "Family and parenting",
      "Relationships and dating",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITAH for asking a religious friend to refrain from praying for my family member?",
      "text": "So today i had told 2 of my colleagues (who i regard as friends) that we discovered that my family member (a very very close one) has cancer, and that the situation is very bad. They were both very nice and offered emotional support which was much appreciated. Later during the day, one of the two, who is a very religious Jewish man, texted me the following:\n\nHim: \"hey, can you tell me {my famaly member's} full name so i can pray for him?\"\n\nMe: \"please don't :)\"\n\nMe: \"but i appreciate the sentiment\"\n\nHim \"you're welcome\"\n\nTo give context, I'm an atheist, and i am very much against these kinds of things (and so is the mentioned family member tbh) . He knows it about me, and we are very respectful to each other's beliefs or lack thereof. We didn't talk about it anymore but had some small talk after it and it doesn't seem to have bothered him, but i can't really know for sure.\n\nWas i the asshole? Could i have maybe handled it better? "
    },
    "categories": [
      "Spirituality and faith",
      "Philosophy and ethics",
      "Relationships and dating"
    ]
  },
  {
    "content": {
      "title": "AITA for yelling at my mom for giving my baby a ”comfort” bottle?",
      "text": "My mom is retired and watches my daughter (18 months) for me while I’m at work. I do appreciate it a lot and she never wants money. The thing is, I don’t always feel like she fully takes me seriously as a parent. I’m single and I struggled a bit in the beginning and I’m not sure my mom ever fully let that go. \n\nHere’s what happened this time. I tried very hard to wean my daughter off of the bottle when she was a year old and communicated with my mother a lot about the switch to sippy cups. \n\nI came home early the other day because of a huge power outage at my job. I see my daughter on the couch happily sucking her bottle. I confronted my mother about it who said she only gives it to her “when she gets hysterical”. I flipped out and I did raise my voice. \n\nWhat’s super annoying is that I know my daughter is smart enough to know what’s going on too since she never even cries to me for one. So basically it’s been their little secret. \n\nAnyway my mom is now mad at me and barely speaking to me. But I feel like anyone would have been angry in my position? AITA for how I reacted?"
    },
    "categories": [
      "Family and parenting",
      "Relationships and dating",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA for not letting a client falsely wear a full military uniform?",
      "text": "So first things first, I work with the mentally disabled and this one client loves to play dress up and his favorite one is wearing full ACU's.  I served in the military and I just don't like it when others wear the uniform without serving. He likes to play the \"I'm an honorary member of my brothers unit\" which he is, but it's no reason to wear the uniform(imo).  I told him that I don't care what he wears while I am not working with him, but when I am to not wear it.  It also gets VERY uncomfortable in public because when someone walks up to him and asks \"your in the military?\" He will lie and say that he is and starts trying to explain what he does and I have to intervene and explain the situation.  I know I am probably the asshole and I should just let him, hes not hurting anyone, but it just annoys me when he goes out and tries to lie about something he never did."
    },
    "categories": [
      "Philosophy and ethics",
      "Work and career",
      "Diversity and inclusion"
    ]
  },
  {
    "content": {
      "title": "HERE'S THE RIGHT WAY TO MEET MEN",
      "text": "i am going with a very nice man i met on a street corner. you probably won't believe this, but i was lost and this nice-looking, well- dressed man approached me and asked if he could help me. i told him my plight and he walked me to where i was going, and that's how we got acquainted.\nwhen people ask how we met, i'm embarrassed to say i just met him on a street corner. it just doesn't sound right.\nabby, what if you meet a person in a restaurant? would you call that a \"pickup\"? how about getting acquainted in a library? (that has a little higher-class ring to it.) meeting someone in a bar sounds rather cheap, but some nice people go to bars alone and don't mind if someone strikes up a conversation with them.\ni avoid eye contact with people i pass in a park, especially if they're walking slowly, or like they're just killing time.\ni think you get the idea. what's ok and what isn't? friendly, but confused"
    },
    "categories": [
      "Relationships and dating",
      "Pop culture and trends",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Young Man Wanders Adrift in Sea of Confused Emotions",
      "text": "i'm a 21-year-old male who feels lost and unfulfilled, and it's because i don't know what i want or deserve. i am one of three adopted children. i was the child who always needed the family support system the most. i come from a not-so-happy family, one with all its priorities centered around money. (or, more accurately, lack of money.) i never felt the love a child should feel from his family.\nmy problem these days is my alcohol intake. i can't stay away from beer. i drink to forget my family problems and the fact that i can't seem to get anything right.\ni dropped out of college because i don't have a passion for anything or anyone. i used to have hobbies -- like writing, photography, etc. -- but the beer has taken away my motivation and creativity.\ni feel i'm losing my will to keep trying. i want so badly to keep trying, but my emotions are keeping me down. i just want something new, something i can give my all to, something that won't hurt me in the future. -- what can i do?"
    },
    "categories": [
      "Personal growth and development",
      "Health and wellness",
      "Family and parenting",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": "Five Year Olds Girls Should Not Be Walking Home Alone",
      "text": "last february, my husband suffered an anoxic brain injury -- lack of oxygen to the brain. needless to say, he is no longer the man he was.\nour friends have all disappeared. they tell me it's hard for them to see him like this. how do they think i feel?\nam i wrong to feel hurt? i don't understand why they can't even call. talking has always been an outlet for me, but no one ever calls me anymore. no one knows how someone else feels until they've been there, but what happened to, \"i'll be there for you,\" or \"call if you need me\"? i wouldn't ask them for anything but conversation.\nis it normal for people to avoid friends when they are in trouble or pain? -- friendless in georgia"
    },
    "categories": [
      "Health and wellness",
      "Relationships and dating",
      "Family and parenting"
    ]
  },
  {
    "content": {
      "title": "Alcoholic Husband's Suicide Continues to Haunt His Wife",
      "text": "can you go to al-anon if you had a husband who was an alcoholic, but is dead? he committed suicide with a 5.0 blood alcohol level.\ni have been a mess for the last two years. i can't sleep, can't concentrate and don't enjoy anything. i would really like to be able to talk with people who understand what living with an alcoholic is like and won't blame me for what he did, as most of his family does. but i hesitate to go to al-anon.\nwhat can i do to get over the self-inflicted death of a man i'll never stop loving? -- hurting in houston"
    },
    "categories": [
      "Health and wellness",
      "Relationships and dating",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "how to define my personal values?"
    },
    "categories": [
      "Personal growth and development",
      "Philosophy and ethics",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Can you create a social media plan for a coffee brand?"
    },
    "categories": [
      "Food and drink",
      "Social media and communication",
      "Entrepreneurship and business"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Act as a HR head for Software development, please suggest a recruitment strategy"
    },
    "categories": [
      "Work and career",
      "Technology",
      "Entrepreneurship and business"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "How can you foster people sustainability in a company?"
    },
    "categories": [
      "Work and career",
      "Entrepreneurship and business",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What are your goals and aspirations?"
    },
    "categories": [
      "Personal growth and development",
      "Work and career",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "what are human actions and decisions based on?"
    },
    "categories": [
      "Philosophy and ethics",
      "Education and learning",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What is the best thing someone can do in life"
    },
    "categories": [
      "Philosophy and ethics",
      "Personal growth and development",
      "Spirituality and faith"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What makes the world go round?"
    },
    "categories": [
      "Philosophy and ethics",
      "Money and finance",
      "Relationships and dating"
    ]
  },
  {
    "content": {
      "title": "AITA for not allowing my children to eat junk food, watch tv, or play video games?",
      "text": "I have two children a 7 year old son and a 9 year old girl. We don’t allow our children to eat junk food, they will sometimes have it if they go to a friends house or on special occasions like Christmas,  but we have zero junk food in our house normally. They sometimes beg me to buy it but normally they’re fine with what they have. We also don’t allow them to watch tv. We do allow them to watch an age appropriate movie at the weekend. And we don’t allow video games because I find absolutely nothing educational about them. Son has started asking to play but we’ve just said no. \n\nBoth our children are happy most the time, they do lots of extracurricular activities, sport/theatre stuff, we teach them how to cook, we play games, we read, they go out on their bikes, play with our dog, listen to music, learn life skills. Both of them are top of their class at school and we are always complimented on how polite and well behaved our children are. \n\nSometimes I feel I’m being a little bit harsh on them by restricting them from this stuff, but I also think this stuff is addictive and poisons their minds. Other family members and friends have told us we are way too strict, but Our kids know far more actual life skills than their peers. So AITA for the way I raise my children? "
    },
    "categories": [
      "Family and parenting",
      "Education and learning",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA for wanting break up with GF because she insists on having kids if we ever got married?",
      "text": "I've been in a relationship with a woman for 4 years and we've done pretty well so far and have moved in together. However, on the topic of having children it's always contentious.\n\nWe've talked about marriage and she always brings up how she wants children. I'm not so excited about it but if I did, I would rather adopt if we did have kids, but to be honest I'd rather have none at all. \n\nFor me, I don't want to give them any of the genes I have that gave me horrible anxiety since I was really young that really interfered with my daily life. Plus, I think the world is regressing with irreversible climate change and as resources and geographies change in the next 40-50 years, I can't say the quality of life would be something I would be looking forward to.\n\nGF will not budge. She wants \"her own\" kids and to me that's really selfish. I understand why - since it's your biologic compulsion to reproduce - but logic can override impulse and I'd rather have none at all or adopt.\n\nIt's driving a serious wedge, but I honestly think I'm in the right."
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Nature and the environment",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "KIDS IN THIRD PLACE WITH GRANDMA",
      "text": "our son is 3 years old. our daughter is 5. my parents live an hour away-by car. i recently phoned and asked them to come and stay with their grandchildren for a weekend while we attend a convention in another city.\nmy mother immediately checked to see if the dates (two months away) were on their \"rv group\" weekend. since we so rarely ask them to baby-sit, and the children love \"nini and papa\" so much, i was hurt, and wrote and told them so.\nmother wrote back, listing her priorities as follows: (1) her job. (she sells real estate.) (2) her favorite activity. (taking rv group trips with her husband, who is retired.) (3) her grandchildren.\nneedless to say, i engaged a baby sitter. my parents are now saying that we should understand their need for freedom. abby, they have stayed with our children overnight only once in a year and a half, when we delivered the kids- never have they driven to our home to baby-sit for the evening.\nwe have decided never again to ask them for anything. are we right or wrong to feel as we do? third place but no show"
    },
    "categories": [
      "Family and parenting",
      "Work and career",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Fireworks on the Fourth Are Best Enjoyed From a Distance",
      "text": "my husband and i have a 29-year-old daughter who is married and has two small children.\nwhen she turned 17, she went to israel and slowly became orthodox jewish. she married a guy just like her. my husband and i are jewish but not religious; however, i accepted her new way of life even though we continue to live our own way of life.\nmy problem is my husband. he says that she went against his wishes, and she should have considered his opinion. he expects me to minimize my visits, saying we are married and should \"work as a team.\"\nabby, religious or not religious, my grandchildren are my life. i will never stop seeing them or loving them. i think my husband needs to hear other people's views. would you care to comment? -- jane in new york"
    },
    "categories": [
      "Family and parenting",
      "Spirituality and faith",
      "Relationships and dating"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "what are some fun things for me to do with my girlfriend as she's visiting me for ten days in roswell, ga"
    },
    "categories": [
      "Relationships and dating",
      "Travel and adventure",
      "Food and drink"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "find me subjects that would help us create a bond and collaboration between the members from differents cities"
    },
    "categories": [
      "Social media and communication",
      "Travel and culture exchange",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "write me a short election speech to vote for me"
    },
    "categories": [
      "Politics and current events",
      "Social media and communication",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "we know the world is combined with the basic elements, but what's it ?"
    },
    "categories": [
      "Science and innovation",
      "Philosophy and ethics",
      "Nature and the environment"
    ]
  },
  {
    "content": {
      "title": "AITA(Am I the Asshole) for forcing my Stepson(7) to finish a level in a video game",
      "text": "My stepson is a constant quitter. He wants to do everything until he realizes it takes effort. Today I was studying while he played the Xbox. He was playing the retro sonic game we got him for Christmas. When he plays as long as the game doesn't require any effort he is cool. The moment there is a trick or something to figure out he goes and grabs his mom. So he is playing the game and this wall comes up. The trick is to grab a power up and blast through. He doesn't realize it so he runs at the wall for 5 minutes. He doesn't try to figure it out at all. So he goes to grab his mom. This time I called BS and told him to come back and finish the game. He said he was done and I said no you need to figure this out because I'm tired of watching you quit. He starts to argue and I cut him off. Eventually he finishes the part. I'm not trying to make him think that video games are a chore but I'm also not trying to raise someone who half asses everything."
    },
    "categories": [
      "Family and parenting",
      "Gaming and technology",
      "Personal growth and development",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA(Am I the Asshole) for wanting my wife to eat my vegetarian cooking?",
      "text": "A couple months ago I decided to become vegetarian, but my wife still eats meat and thats fine to me. I do most of the cooking and so I always cook vegetarian meals. My wife likes the vegetarian food but wants me to cook some non vegetarian food for her aswell sometimes. For example when I cook meat free sausages she wants me to cook normal sausages for her aswell. This would be fine but I already don't like cooking and this just makes it more complicated and time consuming. Also if she wants meat she could just eat it when I'm not cooking or do more cooking herself. AITA for wanting her to eat my vegetarian food?"
    },
    "categories": [
      "Relationships and dating",
      "Food and drink",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Request for parenting advice for teens about avoiding early parenthood",
      "text": "I have two children, 15 and 17. Many of their friends are becoming single parents. Not wanting that for my children, I talk to them and urge them not to have babies until they're ready to be good parents. You are so good at coming up with lists for things, Abby. Could you compile a list of criteria for what makes a really good parent? It would be nice to show them what that adds up to. – Nancy in Flagstaff, Ariz."
    },
    "categories": [
      "Family and parenting",
      "Education and learning",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "Advice needed for woman feeling trapped in loveless marriage",
      "text": "After a marriage of many years, I have come to realize ours has become simply one of convenience. My husband is a negative and controlling person who gripes about everything and anything. He has developed no friendships or interests of his own, and I have to battle with him to even have a day to myself. How many other women are like me – stuck in loveless marriages without the resources to live on our own (at least in the lifestyle we are accustomed to)? Any advice for me? – In Limbo Out West"
    },
    "categories": [
      "Relationships and dating",
      "Personal growth and development",
      "Money and finance"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "If I'm addicted to impulse spending when I feel bored and we can assume this is a dopamine issue, what are some alternative ways to address that boredom?"
    },
    "categories": [
      "Money and finance",
      "Health and wellness",
      "Personal growth and development",
      "Mindfulness and meditation"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What is love?"
    },
    "categories": [
      "Philosophy and ethics",
      "Relationships and dating",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What can I do, if I feel lonely."
    },
    "categories": [
      "Health and wellness",
      "Relationships and dating",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "If you have 100 million baht but you have to spend it all in one day, what should you use the money for?"
    },
    "categories": [
      "Money and finance",
      "Philosophy and ethics",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "AITA for getting fucking pissed at my date for running a red light?",
      "text": "So I’m with a date with with girl (second date, she’s cool) and she’s driving me home. It’s 2 am and there’s not a car in the road in sight.\n\nSo we stop at a red light. She looks both ways, sees no cars, and runs it.\n\nI’m verbally pissed. I tell her even if there’s no cars you have to stop. It’s dangerous and I thought it was immature.\n\nShe thought I was being overdramatic and a drama queen.\n\nI honestly don’t think I’m the asshole, sure it was rude to call her out on it but I don’t think running red lights is EVER socially acceptable. "
    },
    "categories": [
      "Relationships and dating",
      "Philosophy and ethics",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": "AITA for discussing my relationship and sex life with my friends?",
      "text": "The other day a couple work friends and I (both female, as am I) were talking and we got on the subject of sex. I mentioned that my boyfriend and I don’t have it often and that he doesn’t give oral because he doesn’t like it. I didn’t bash him for either, I had just mentioned it. One of the girls I was talking to told my boyfriend yesterday that she feels bad for me since we don’t have sex very often and my boyfriend got pissed that I talk about intimate things with them and said it’s none of their business and is now wondering what kind of things I tell my closer friends. The thing is, I do tell my close friends about my relationship including my sex life and even sometimes telling them about a fight we got in or something. Also, I have been there when he has said something about our sex life to one of his friends, but maybe I just do it to a more intimate degree or more often. He’s now pissed and says he can’t trust me anymore and is telling me that if it’s that big of deal then I should find someone else. I always thought this kind of conversation with friends was normal and healthy considering I’m not degrading him or telling his “secrets” or something to them. Maybe I’m wrong. AITA for discussing my relationship/sex life with my friends?"
    },
    "categories": [
      "Relationships and dating",
      "Social media and communication",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Husband Demanding Attention Interferes With Sisterly Chat",
      "text": "i am 16 years old and having trouble finding a way to tell my parents that i'm a lesbian. every day i wish i could find the courage to say, \"mom, dad, i'm gay!\" but it's a lot more complicated than that. they are very religious, and i have seen firsthand how they react to homosexuality. that's why it's going to be so hard to break the news. i don't want to tell them, but i know that i have to in order to get on with my life. what should i do? -- trapped in georgia"
    },
    "categories": [
      "Family and parenting",
      "Spirituality and faith",
      "Diversity and inclusion",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "SPORTING HUSBAND NOT GAME FOR MARRIAGE; GET HELP QUICK",
      "text": "my problem is growing, and i am going crazy. my husband pursues the following throughout the year: hunting, fishing, football, basketball, baseball, golf, softball (two teams) and bowling!\ni am home with two children. one is 3 1/2; the baby is 5 months old. some of my friends say, \"go to work; you've got to get out of the house and do your own thing.\" wrong! i tried it when my firstborn was a year old. i worked as a secretary for peanuts, came home dead tired and had to do 90 percent of the work at home because either my husband wasn't home or he was watching sports on tv.\nthank god he doesn't drink or chase other women. he does bring home a good paycheck, but i'm tired of being ignored while he's away at a game or participating in one.\ni hate to give him an ultimatum, but i have such deep resentment building up inside me. what should i do? married with no husband."
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Sports and fitness",
      "Work and career"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "what are the emotional, philosophical and cultural reasons would a newly wed couple choose for visiting on valentines day"
    },
    "categories": [
      "Relationships and dating",
      "Philosophy and ethics",
      "Travel and culture exchange"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "List up why a person's ability to write and the ability to think are important even if the person has GPT."
    },
    "categories": [
      "Education and learning",
      "Personal growth and development",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "make a list of all the benefits if canada and the united states would become one country "
    },
    "categories": [
      "Politics and current events",
      "Money and finance",
      "Travel and culture exchange"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What Happens to me when I die?"
    },
    "categories": [
      "Philosophy and ethics",
      "Spirituality and faith",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "AITA for saying my husband absolutely can't get a motorcycle?",
      "text": "Throwaway in case he sees this. He may anyways but I'll deal with that if it happens.\n\nHusband is 34, smartest guy I know academically but common sense challenged. He's a geologist for a major oil company and works very, very hard and makes a good living. But we have had to live in some real shit holes over the years (like SA, where I really didn't leave our company compound for 2 years). We are back in the LA area and he thinks now we have \"open roads\" (the 405...what?) he wants a motorcycle. \n\nI am dead against it. They are too dangerous, it probably won't get used, it's a bad example for the kids, it looks super douche-bro, and I think he'll move onto his next hobby and forget about it.\n\nWe aren't getting divorced over this or anything but our opposing stances are causing major friction. Am I the asshole?"
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA for paying off my wife's loans without asking.",
      "text": "Dated for 3 years, and during our second year, she took at 14.99% APR loan on a car. She has been paying more than minimum, and should have had it paid off in 3 years rather than 5. However, one month after our marriage, I paid the whole thing off for her without consulting.\n\nShe is upset because I have taken away her responsibility and feels like I constantly get involved and take over financial maters.\n\nNot sure what to do...\n\nSorry that this isn't as nicely worded or as juicy of a story as most of the top posts. "
    },
    "categories": [
      "Relationships and dating",
      "Money and finance",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Friends Don't Allow Friends to Destroy Lives With Drugs",
      "text": "i have a serious problem with my best friend. \"jennifer\" and i used to tell each other everything, and i thought our friendship would be forever. but recently i have not been able to understand her at all.\njennifer has started using drugs. i knew she was smoking pot, but she had promised me she wouldn't do anything heavier. now i know she was lying to me. i've tried to get her to quit, but it's getting worse every day. we argue a lot and sometimes she swears at me. (she never did that before she was on drugs.)\nwe are students, and i can't study because i'm so worried about her.\ntwo weeks ago i decided i couldn't stand it any more and made a decision to stay away from her. i still would like to be jennifer's friend because i remember what a sweet girl she used to be. but now i don't know if i even like her. even though i feel freedom after separating from her, i worry that maybe i'm making her life worse by not being there for her when she needs me.\nabby, should i still be a friend of hers or not? -- confused in california"
    },
    "categories": [
      "Health and wellness",
      "Relationships and dating",
      "Personal growth and development",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": "'Only' Child Finally Discovers Half Sisters She Never Knew",
      "text": "i am an only child. four years ago, when i was 19, i lost my father to cancer. recently i was sorting through some of dad's papers and found an old will. it said something to the effect that \"i, michael, am the father of sarah and anne, both from a previous marriage. when i refer to 'my daughter,' in the remainder of the will, i am speaking only of 'kelly.'\" (that's me.) i was floored. i have two older half-sisters i was never told about! growing up, i hated being an only child and begged my parents to have more children.\ni do not believe my father was a \"deadbeat dad,\" because he always spoke harshly about individuals who didn't pay child support. he traveled the world in the military and lived in many countries and states before he met my mother.\nabby, i am afraid to confront my mother. i know i shouldn't have snooped through my father's old papers, but i feel i had the right to know i have two half-siblings. what do i do now? -- not my father's only precious girl"
    },
    "categories": [
      "Family and parenting",
      "Personal growth and development",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "write some questions couples can ask each other to get to know each other more intimately"
    },
    "categories": [
      "Relationships and dating",
      "Personal growth and development",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Draw an analogy between the human life cycle and the seasons, and explain the connection between each stage and the corresponding season."
    },
    "categories": [
      "Philosophy and ethics",
      "Nature and the environment",
      "Personal growth and development",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "lets say i have build a underground bunker of 40 level, what should the 40 levels be used for?"
    },
    "categories": [
      "Science and innovation",
      "Technology",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "what is the first thing a dolphin will tell us if it can speak?"
    },
    "categories": [
      "Nature and the environment",
      "Science and innovation",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": "AITA for telling people to stop complaining when they do favors for me?",
      "text": "Okay, this totally sounds like I'm being a dick, but let me explain. A lot of the time I'll ask my friends for favors. Pour me a glass of water since you're in the kitchen, drive me to school, etc. I'll ask, and then sometimes they'll go, \"UGGGGHHHH, fine. Can't you do it yourself?\"\n\n\"You don't have to do it,\" I say. \"You can say no. I won't be mad.\"\n\n\"UGH, no, it's fine. I'll fucking do it.\"\n\n\"Are you sure? You really sound like you don't want to. I can just do it if you're not up for it.\"\n\n\"No, I'll just do the stupid favor!\"\n\n\"Alright, well either don't do it, or stop whining about it!\"\n\nI feel like an asshole because I'm so harsh at a person who's willing to do something for me, but at the same time, they clearly don't want to do it, so why do it and complain when I repeatedly tell them that they don't have to?"
    },
    "categories": [
      "Relationships and dating",
      "Philosophy and ethics",
      "Social media and communication",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": "AITA (or we, wife and I) for buying a house in an underserved Hispanic community?",
      "text": "Will keep this very short but can add INFO if needed. Wife and I came into some nice inheritance in mid 2018. We decided that we are going to use the money to see the world and live in exotic places while trying to get our dream careers going (me: writer, she: clothing designer). We also wanted to live in underserved communities where we could be around real people instead of the Dallas suburbs we grew up in or in gentrified SoHo where we moved from.\n\n\nWe decided on South Tucson, AZ. It is 90% Hispanic, historic and gorgeous. We were able to buy a house for a song and we eagerly moved in 2 weeks ago. However the reception has not been good. At first we figured that maybe we were the first open lesbian couple they had seen so we went around and introduced ourself last week and people were either not friendly and our 65 year old neighbor told us that white people like us only bring problems to the neighborhood. We asked her to explain, she said if she has to explain then we truly don’t get it. \n\nI don’t think we are assholes but I sure felt like it  after speaking with our neighbor. We are just trying to experience a different culture...I thought that was a good thing.\n"
    },
    "categories": [
      "Diversity and inclusion",
      "Travel and culture exchange",
      "Art and culture"
    ]
  },
  {
    "content": {
      "title": "SUCH CHARITY IS MISDIRECTED",
      "text": "i am to be married soon and have a very serious problem to face. my fiance's father is seriously ill. (he's terminal.) the doctors have just given him a period of time to live, which comes very close to our wedding date. we set our wedding date four months ago--before we knew how sick he was.\nif he is called by god close to our wedding date, what is the proper etiquette with regard to our wedding? how can we handle the joy of our wedding with the sorrow of his passing, which will be mourned by my fiance's mother and the rest of his family?\nplease answer soon as there isn't much time. happy and sad"
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Spirituality and faith"
    ]
  },
  {
    "content": {
      "title": "MOM UPSET BY NEW PART-TIME ROLE",
      "text": "during the past 10 years, i have raised four children. the last two are twins. as the school year begins, i see my babies going off to school full time. what happens now?\nwe can't wait until our children say their first words, take their first steps, are finally out of diapers, and then-boom, they are off to kindergarten!\ni actually looked forward to their being in school all day, but now that it has happened, i am lost. i don't know what to do with myself. i ask myself if i should take up a hobby or get a job. or perhaps have another baby?\nam i crazy for feeling this way? are there others out there who have felt this way? brentwood, n.y., mom"
    },
    "categories": [
      "Family and parenting",
      "Personal growth and development",
      "Work and career"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "compose a poem on why the lack of AI tech is good for humanity"
    },
    "categories": [
      "Technology",
      "Philosophy and ethics",
      "Art and culture"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Got any creative ideas for a 8 year old’s birthday?"
    },
    "categories": [
      "Family and parenting",
      "Creativity and inspiration",
      "Music and entertainment"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What is the meaning of life"
    },
    "categories": [
      "Philosophy and ethics",
      "Personal growth and development",
      "Spirituality and faith"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Tell me what to prioritise in life"
    },
    "categories": [
      "Personal growth and development",
      "Philosophy and ethics",
      "Mindfulness and meditation"
    ]
  },
  {
    "content": {
      "title": "AITA for letting my boyfriend's passport expire before our trip?",
      "text": "My boyfriend of over a year and I are going to an out of country destination for a week in March. I love him a lot but he can be juvenile and I find myself feeling at times likes a mother and child dynamic.\n\nHis passport has been expired since May 2018, and I have brought it up several times to get it renewed. We have even had a tiff or two over it. In November, we booked and paid for this trip. It cost about 1000$ each. \n\nThe deadline of him needing to have his passport sent off so he can get it back in time is approaching quickly. I guess I'm asking preemptively to this so I know if I'd be an asshole if I followed through with what I am currently intending on doing : I'm not going to say shit and let him deal with the consequences if he doesn't get it together on time. I'll have a lovely vacation on my own. \n\nBe honest. Would that make me an asshole to knowingly let him miss out on our trip?"
    },
    "categories": [
      "Travel and adventure",
      "Relationships and dating",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA for telling my mum she wasn’t a great parent when she criticised gay people having kids...",
      "text": "Ok so we were having a discussion the other day about gay people having children. My mum said kids should have a mother and father 🙄. I said there’s plenty of people who split up, a parent dies etc and the kid is fine. She said but having a mother and father is still better...I said not necessarily. If those parents were abusive, poor and couldn’t care properly for their kids then they’re not gonna be better than two parents of the same sex who aren’t abusive and can financially and emotionally support their kids. She then said that money had nothing to do with it and a poor heterosexual would be much better parents than a financially stable gay couple 🤦🏻‍♀️ \n\nI said that’s bullshit. I said us not having a lot of money growing up did badly affect me. It made everything a lot harder, my mental and physical health suffered because of it. I also said that my parents constant arguing and fighting with one another, plus my mothers constant screaming at me affected me badly and it would have been better for me to be bought up by gay people who could finically support me and who didn’t give me severe anxiety from the constant fighting. \n\nShe’s now not talking to me. Calling me disrespectful, saying she gave up a lot for me and I’m ungrateful. \n\nSo AITA for saying this, or is she the asshole? "
    },
    "categories": [
      "Family and parenting",
      "Diversity and inclusion",
      "Philosophy and ethics",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": "Eager Little Leaguers Suffer Major League Disappointment",
      "text": "my husband, \"greg,\" and i dated five years before we married two years ago. greg is catholic and i am southern baptist. his family was aware of our religious differences from the beginning. we were completely candid that neither of us would convert from our religions, and that our children would be raised baptist until they were old enough to decide otherwise.\non our wedding day, no one from greg's family showed up, and i watched tears stream down my husband's face on what should have been the happiest day of his life. it has been very difficult ever since. his parents christened our child at their home without greg's or my consent. there have been other problems -- too numerous to mention.\nthe last straw came three months ago. greg's older sibling was also married in a non-catholic church. this time, the entire family, including us, attended.\nthe problem with greg's parents has caused a major strain on our marriage. we have invited them over on numerous occasions to hash out our differences, but they have never showed up. after our last attempt, they said they had nothing else to talk to us about.\nabby, i feel no love lost because of their absence, and my toddler really doesn't know them anyway. however, i am concerned about my husband's feelings. he and my child mean the world to me. i don't want my marriage to suffer. i'm worried that if this continues much longer, i'll lose my temper with the situation. can you help us? -- losing my cool in georgia"
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "Son Learns Mom Is Stepping Out on Dad While He's in Jail",
      "text": "my father went to prison five years ago, and my mother has been taking care of my brother and sister. (i'm older and out of the house.)\ni recently came across some shocking information. mom has been going on dates with a clergy member who has been sending her text messages saying things like \"i can't stop thinking about you,\" etc. i also found out she has a profile on a couple of internet dating sites and has been coming home later than usual after going out \"for drinks with friends\" after work. when i confronted her, she first denied it, then got caught in a lie. she refuses to accept responsibility, insisting \"it wasn't a date,\" although this man expressed romantic feelings for her.\nmy father knows nothing about this while he languishes in a cell for what could be another five or six years. should i tell him? i also do not know if i should confront this clergyman because i find his actions despicable.\nhow can i explain to my mother that what she's doing is wrong? when i try to talk to her in a mature way, she says things like, \"i can't hear you!\" any advice you can offer would be appreciated. -- disillusioned son in new jersey"
    },
    "categories": [
      "Relationships and dating",
      "Family and parenting",
      "Spirituality and faith",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "write a fun filled message for a star performing associate who is leaving the firm to pursue MBA"
    },
    "categories": [
      "Work and career",
      "Education and learning",
      "Personal growth and development"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Write a lovely message to new wedded couple who are friends."
    },
    "categories": [
      "Relationships and dating",
      "Creativity and inspiration",
      "Family and parenting"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "I'm going to Vienna with my gf and my mother for 3 days in august. Make me a plan"
    },
    "categories": [
      "Travel and adventure",
      "Travel and culture exchange",
      "Family and parenting"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Create short Google Ads compelling headlines within 5 words that let customers believe they should buy right now"
    },
    "categories": [
      "Entrepreneurship and business",
      "Technology",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": "AITA for wanting to sleep at night while my wife takes care of our newborn?",
      "text": "My wife and I just had our second kid last week and I want to sleep at night while she takes care of the nightly feedings and diaper changing.\n\nMy wife is on maternity leave and she had no complications with the birth and is not bed ridden or anything. Our oldest daughter gets dropped off at daycare and my wife takes care of the newborn during the day and does household chores and such.\n\nI went back to work on Monday working an office job 9-6 and it’s not a stressful job or anything. I also stay up till about 12-1 doing homework for my MBA. I do help with the newborn when I am home and for anything my wife or baby needs till I go to sleep. \n\nI want to be able to sleep through the night since I’m up late and have to work in the morning but my wife expects me to wake up every 2-3 hours and help with feedings and stuff while she pumps to try to get met milk in. \n\nAMTA for not wanting to wake up and help?"
    },
    "categories": [
      "Family and parenting",
      "Work and career",
      "Relationships and dating"
    ]
  },
  {
    "content": {
      "title": "AITA for telling my wife I was away for a business trip, when really I went on a city break on my own?",
      "text": "I love my wife but she is awful to travel with. She's a bit of a princess and she doesn't care about art or architecture. She wears stupid shoes and walks too slow, but gets tired of places too fast.\n\nI did originally have a meeting in London but it got cancelled and I still wanted to go, so I booked myself into a fancy hotel, went to galleries, rode the subway and ate in amazing restaurants for three nights. Aw man it was awesome. I just enjoyed not caring about her being entertained and being alone to my thoughts.\n\nI just kept thinking the whole time I was there how she wouldn't have liked it, and would have ruined it. If I'd have told her about it she would have come with me, no question. \n\nAm I an asshole?"
    },
    "categories": [
      "Relationships and dating",
      "Travel and adventure",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "ALCOHOLIC'S PLIGHT UPSETS STRANGER",
      "text": "i placed an ad in our local lincoln paper to \"drive your car to any destination for a fee.\" this morning a lady called, wanting me to drive her to a retirement home in texas. after the price was agreed upon, i went to her apartment in lincoln.\nwhen she met me at the door she was crying, saying she was an alcoholic --and a very sick woman--and could i please help her. the poor woman was shaking, so i suggested we call a family member as i had never seen this lady before in my life. (there is alcoholism in my family, so my heart went out to her.) she said she was 69, but she looked much older. she started shaking badly, and began looking for her bottle. (she had bottles hidden all over the place, but the ones i found were empty!) we visited for half an hour, then she fell asleep on the couch, so i called the apartment manager who turned out to be a young lady about 35. she said, \"leave her alone; don't get involved. go on home.\"\ni went home, but, abby, this poor lady has called me five times asking me to come back. part of me says, \"go back and try to help her,\" and the other half says, \"listen to the manager--don't get involved.\"\ni feel guilty because like most people, i don't want to get involved, but i can't get this lady out of my mind. she said she has no family. what would you do in a case like this? w.f., palmyra, neb."
    },
    "categories": [
      "Health and wellness",
      "Philosophy and ethics",
      "Entrepreneurship and business"
    ]
  },
  {
    "content": {
      "title": "Cold Hearted Comment Turns Bedroom Into Deep Freeze",
      "text": "my 12-year-old niece, \"amanda,\" is on her cell phone constantly. she is the smartest kid i know, but she is failing her classes and has started to lie about everything. i raised her until she was 5 -- i was only 12 myself when i started -- so i am very close to her. or so i thought.\namanda lives with her dad and stepmom, who are doing their best to raise her, but nothing is working. when she was growing up she never lied, and i mean never. i have told her not to be afraid to talk to me about anything, but she hasn't, and it hurts me that she can't come to me. what do you suggest i do? -- worried aunt in washington"
    },
    "categories": [
      "Family and parenting",
      "Education and learning",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Write me some good holiday greetings"
    },
    "categories": [
      "Literature and writing",
      "Creativity and inspiration",
      "Social media and communication"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "embarrassment and shame keep me from being honest with my girlfriend. List some ways to work on this."
    },
    "categories": [
      "Relationships and dating",
      "Personal growth and development",
      "Mindfulness and meditation"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "if life was a videogame, what would the core stats and attributes be?"
    },
    "categories": [
      "Gaming and technology",
      "Philosophy and ethics",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "Please make a social media caption for 25th birthday"
    },
    "categories": [
      "Social media and communication",
      "Personal growth and development",
      "Creativity and inspiration"
    ]
  },
  {
    "content": {
      "title": "AITA for being hurt by my daughter's name change",
      "text": "My wife kept her last name when we married, but we gave my last name to our children. My daughter changed her name to her husband's when she got married. They are now in the process of a divorce.\n\nMy daughter mentioned today that she wants to change her last name not back to my name, but to her mother's name. She wants to honor everything my wife has done for her.\n\nI'm a little hurt by this and told her so. She's free to do as she pleases, but the presentation of it all just makes it feel like she values her mother's contribution over mine. AITA?"
    },
    "categories": [
      "Family and parenting",
      "Relationships and dating",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "AITA for warning this guy about his date",
      "text": "I'm a waiter at a sports bar. There's this girl who comes in with a different guy almost every week. Very rarely does she bring the same guy twice, and she's always pulling the same moves with these guys.\n\nShe went to the bathroom and I just went over to her date and let him know that his date was here all the time with different guys and he should be careful. He left pretty quickly after that. The girl apparently complained about it, because my boss wrote me up.\n\nAITA for trying to be a bro?"
    },
    "categories": [
      "Relationships and dating",
      "Work and career",
      "Philosophy and ethics"
    ]
  },
  {
    "content": {
      "title": "HALF-TRUTHS TELL THE WHOLE STORY",
      "text": "i need your advice about something-sales clerks. i can't stand them! they aggravate me beyond belief. sometimes i even leave the store if they really get to me. i try not to ask for their help because when i do, they stick to me like glue until i leave the store. if i go to try something on, they will be waiting for me to tell me how good i look.\nabby, when i try something on, i like to look at it alone and think about buying it, not feel like i'm pressured for time to get out of the change room. if sales clerks want to sell something, they have to give the customer space and privacy.\nin the meantime, do you know of a way to tell these salespeople that their help is appreciated, but you would like to be left alone? sign me ... too much attention"
    },
    "categories": [
      "Fashion and style",
      "Personal growth and development",
      "Work and career"
    ]
  },
  {
    "content": {
      "title": "Woman Wonders if It Is Ok to Settle for Mr. Almost Right",
      "text": "some new neighbors moved into our beautiful neighborhood recently. this couple, who seem very nice, have gotten an adorable puppy i'll call \"taffy.\"\ntaffy is now about 6 months old. they leave her in front of their house, completely alone, for most of the day and all night. from what we can see, that poor dog is never allowed inside. taffy craves affection, and we all stop to pet her whenever we go by the house, just to allay some of her loneliness and boredom.\nhow should we deal with this painful situation? do we dare say anything to the owners -- which will obviously cause \"neighbor difficulties\"? please advise. -- sally in san diego"
    },
    "categories": [
      "Philosophy and ethics",
      "Social media and communication",
      "Relationships and dating"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "What are values that are important to people?"
    },
    "categories": [
      "Philosophy and ethics",
      "Personal growth and development",
      "Education and learning"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "how do I make it feel more like Christmas in my house"
    },
    "categories": [
      "Art and culture",
      "Creativity and inspiration",
      "Family and parenting"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "what's the most important world historical event?"
    },
    "categories": [
      "History and nostalgia",
      "Education and learning",
      "Politics and current events"
    ]
  },
  {
    "content": {
      "title": null,
      "text": "who is the coolest, smartest person in the world? must give 1 name, nothing else."
    },
    "categories": [
      "Pop culture and trends",
      "Social media and communication",
      "Philosophy and ethics"
    ]
  }
]