[
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for getting fucking pissed at my date for running a red light?",
            "text": "So I’m with a date with with girl (second date, she’s cool) and she’s driving me home. It’s 2 am and there’s not a car in the road in sight.\n\nSo we stop at a red light. She looks both ways, sees no cars, and runs it.\n\nI’m verbally pissed. I tell her even if there’s no cars you have to stop. It’s dangerous and I thought it was immature.\n\nShe thought I was being overdramatic and a drama queen.\n\nI honestly don’t think I’m the asshole, sure it was rude to call her out on it but I don’t think running red lights is EVER socially acceptable. "
        },
        "statistics": {
            "word_count": 108,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 4,
                "relevant_values": [
                    "Self-Direction",
                    "Security",
                    "Conformity",
                    "Achievement"
                ]
            }
        },
        "extra": {
            "id": "OvOGx5r2R4F1Zs7BKFKDpbW3TRNWPZgX",
            "post_id": "b2mgbh",
            "right": 24,
            "wrong": 14,
            "portrait_id": 1003
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for discussing my relationship and sex life with my friends?",
            "text": "The other day a couple work friends and I (both female, as am I) were talking and we got on the subject of sex. I mentioned that my boyfriend and I don’t have it often and that he doesn’t give oral because he doesn’t like it. I didn’t bash him for either, I had just mentioned it. One of the girls I was talking to told my boyfriend yesterday that she feels bad for me since we don’t have sex very often and my boyfriend got pissed that I talk about intimate things with them and said it’s none of their business and is now wondering what kind of things I tell my closer friends. The thing is, I do tell my close friends about my relationship including my sex life and even sometimes telling them about a fight we got in or something. Also, I have been there when he has said something about our sex life to one of his friends, but maybe I just do it to a more intimate degree or more often. He’s now pissed and says he can’t trust me anymore and is telling me that if it’s that big of deal then I should find someone else. I always thought this kind of conversation with friends was normal and healthy considering I’m not degrading him or telling his “secrets” or something to them. Maybe I’m wrong. AITA for discussing my relationship/sex life with my friends?"
        },
        "statistics": {
            "word_count": 242,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Achievement",
                    "Power",
                    "Security",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "V1zf2gEMQ3oHEVByOs0mQQtQHYNylVUo",
            "post_id": "afwuws",
            "right": 14,
            "wrong": 21,
            "portrait_id": 1006
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for not letting a client falsely wear a full military uniform?",
            "text": "So first things first, I work with the mentally disabled and this one client loves to play dress up and his favorite one is wearing full ACU's.  I served in the military and I just don't like it when others wear the uniform without serving. He likes to play the \"I'm an honorary member of my brothers unit\" which he is, but it's no reason to wear the uniform(imo).  I told him that I don't care what he wears while I am not working with him, but when I am to not wear it.  It also gets VERY uncomfortable in public because when someone walks up to him and asks \"your in the military?\" He will lie and say that he is and starts trying to explain what he does and I have to intervene and explain the situation.  I know I am probably the asshole and I should just let him, hes not hurting anyone, but it just annoys me when he goes out and tries to lie about something he never did."
        },
        "statistics": {
            "word_count": 174,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Hedonism",
                    "Achievement",
                    "Benevolence",
                    "Conformity"
                ]
            }
        },
        "extra": {
            "id": "et10H4py5Y8iPGaVhzeHljVEiDSOpOTX",
            "post_id": "b5qkkw",
            "right": 20,
            "wrong": 14,
            "portrait_id": 1008
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for going on a long weekend with friends, leaving my wife with the kids?",
            "text": "My wife (married 6 years, together 10 years) is a stay-at-home parent for our two children (4, 1.5). \nI work pretty long hours and sometimes travel for work, leaving her to do most the parenting and housework. On weekends I generally pitch in, spending time with the kids, cooking, etc. \n\nThis weekend I’ve decided to go on a long weekend with a friend to a music festival, Thursday to Sunday. \nIt’s been hard on my wife, she’s exhausted from the week and then she’s not getting a break over the weekend as I’ve gone away. \n\nI feel bad for leaving her and it’s tough on her, but it’s one weekend away in the year. \n\nShe’s made it clear that 4 days away is too much and that I’ve made the wrong decision. \n\nSo what do you think Reddit - AITA?"
        },
        "statistics": {
            "word_count": 140,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 7,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Power",
                    "Security",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "id": "DvUO0WRRCSB4PtioFByCMcbWyAORdqBU",
            "post_id": "b4as91",
            "right": 33,
            "wrong": 41,
            "portrait_id": 1009
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for wanting break up with GF because she insists on having kids if we ever got married?",
            "text": "I've been in a relationship with a woman for 4 years and we've done pretty well so far and have moved in together. However, on the topic of having children it's always contentious.\n\nWe've talked about marriage and she always brings up how she wants children. I'm not so excited about it but if I did, I would rather adopt if we did have kids, but to be honest I'd rather have none at all. \n\nFor me, I don't want to give them any of the genes I have that gave me horrible anxiety since I was really young that really interfered with my daily life. Plus, I think the world is regressing with irreversible climate change and as resources and geographies change in the next 40-50 years, I can't say the quality of life would be something I would be looking forward to.\n\nGF will not budge. She wants \"her own\" kids and to me that's really selfish. I understand why - since it's your biologic compulsion to reproduce - but logic can override impulse and I'd rather have none at all or adopt.\n\nIt's driving a serious wedge, but I honestly think I'm in the right."
        },
        "statistics": {
            "word_count": 198,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "TLaAQz74KbwPjHdF4Wj8aWiQkwiW0XEH",
            "post_id": "b3f5kn",
            "right": 35,
            "wrong": 20,
            "portrait_id": 1013
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for telling my mum she wasn’t a great parent when she criticised gay people having kids...",
            "text": "Ok so we were having a discussion the other day about gay people having children. My mum said kids should have a mother and father 🙄. I said there’s plenty of people who split up, a parent dies etc and the kid is fine. She said but having a mother and father is still better...I said not necessarily. If those parents were abusive, poor and couldn’t care properly for their kids then they’re not gonna be better than two parents of the same sex who aren’t abusive and can financially and emotionally support their kids. She then said that money had nothing to do with it and a poor heterosexual would be much better parents than a financially stable gay couple 🤦🏻‍♀️ \n\nI said that’s bullshit. I said us not having a lot of money growing up did badly affect me. It made everything a lot harder, my mental and physical health suffered because of it. I also said that my parents constant arguing and fighting with one another, plus my mothers constant screaming at me affected me badly and it would have been better for me to be bought up by gay people who could finically support me and who didn’t give me severe anxiety from the constant fighting. \n\nShe’s now not talking to me. Calling me disrespectful, saying she gave up a lot for me and I’m ungrateful. \n\nSo AITA for saying this, or is she the asshole? "
        },
        "statistics": {
            "word_count": 240,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Achievement",
                    "Benevolence",
                    "Universalism",
                    "Conformity"
                ]
            }
        },
        "extra": {
            "id": "Q1v8JzXSWHNbvhw5wUWoOqiTbryfqezC",
            "post_id": "b61und",
            "right": 122,
            "wrong": 94,
            "portrait_id": 1015
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for telling people to stop complaining when they do favors for me?",
            "text": "Okay, this totally sounds like I'm being a dick, but let me explain. A lot of the time I'll ask my friends for favors. Pour me a glass of water since you're in the kitchen, drive me to school, etc. I'll ask, and then sometimes they'll go, \"UGGGGHHHH, fine. Can't you do it yourself?\"\n\n\"You don't have to do it,\" I say. \"You can say no. I won't be mad.\"\n\n\"UGH, no, it's fine. I'll fucking do it.\"\n\n\"Are you sure? You really sound like you don't want to. I can just do it if you're not up for it.\"\n\n\"No, I'll just do the stupid favor!\"\n\n\"Alright, well either don't do it, or stop whining about it!\"\n\nI feel like an asshole because I'm so harsh at a person who's willing to do something for me, but at the same time, they clearly don't want to do it, so why do it and complain when I repeatedly tell them that they don't have to?"
        },
        "statistics": {
            "word_count": 165,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Benevolence",
                    "Conformity",
                    "Security",
                    "Achievement",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "T8CCc9yrRKTucBw0QlMpm8Swfggf6Z0D",
            "post_id": "b9012u",
            "right": 13,
            "wrong": 19,
            "portrait_id": 1021
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for paying off my wife's loans without asking.",
            "text": "Dated for 3 years, and during our second year, she took at 14.99% APR loan on a car. She has been paying more than minimum, and should have had it paid off in 3 years rather than 5. However, one month after our marriage, I paid the whole thing off for her without consulting.\n\nShe is upset because I have taken away her responsibility and feels like I constantly get involved and take over financial maters.\n\nNot sure what to do...\n\nSorry that this isn't as nicely worded or as juicy of a story as most of the top posts. "
        },
        "statistics": {
            "word_count": 100,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Security",
                    "Power",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "id": "BVntlhFWivqsff9HIz9wAyJtPfuMcjaz",
            "post_id": "b8lvqc",
            "right": 37,
            "wrong": 16,
            "portrait_id": 1023
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for warning this guy about his date",
            "text": "I'm a waiter at a sports bar. There's this girl who comes in with a different guy almost every week. Very rarely does she bring the same guy twice, and she's always pulling the same moves with these guys.\n\nShe went to the bathroom and I just went over to her date and let him know that his date was here all the time with different guys and he should be careful. He left pretty quickly after that. The girl apparently complained about it, because my boss wrote me up.\n\nAITA for trying to be a bro?"
        },
        "statistics": {
            "word_count": 97,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Conformity",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "9ZHGks24iKu3H2M2E7imb94E1pKDNYnk",
            "post_id": "au21gp",
            "right": 95,
            "wrong": 199,
            "portrait_id": 1024
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA - I saw a video of this guy video taping himself giving sandwiches to homeless people and I commented that he was vain",
            "text": "Yesterday online I saw a post titled “My First ever LinkedIn Video. Me giving out sandwiches to the poor.” \n\nI thought this was incredibly vain so I commented “It was nice of you to do this but I’ve never been able to understand why people feel the need to video tape and post themselves doing something nice. Doesn’t this kind of defeat the entire purpose of doing a good deed? it becomes clear that your motivation isn’t exclusively that you want to help others?”\n\nI received a good amount of hate for this comment so I’m wondering reddit - AM I THE ASSHOLE?? "
        },
        "statistics": {
            "word_count": 103,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Conformity",
                    "Benevolence",
                    "Universalism",
                    "Tradition"
                ]
            }
        },
        "extra": {
            "id": "IkNrFRW792nRRznIQBFPjCjUQIA0kPw0",
            "post_id": "ara05f",
            "right": 243,
            "wrong": 243,
            "portrait_id": 1025
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for wanting to sleep at night while my wife takes care of our newborn?",
            "text": "My wife and I just had our second kid last week and I want to sleep at night while she takes care of the nightly feedings and diaper changing.\n\nMy wife is on maternity leave and she had no complications with the birth and is not bed ridden or anything. Our oldest daughter gets dropped off at daycare and my wife takes care of the newborn during the day and does household chores and such.\n\nI went back to work on Monday working an office job 9-6 and it’s not a stressful job or anything. I also stay up till about 12-1 doing homework for my MBA. I do help with the newborn when I am home and for anything my wife or baby needs till I go to sleep. \n\nI want to be able to sleep through the night since I’m up late and have to work in the morning but my wife expects me to wake up every 2-3 hours and help with feedings and stuff while she pumps to try to get met milk in. \n\nAMTA for not wanting to wake up and help?"
        },
        "statistics": {
            "word_count": 187,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Hedonism",
                    "Achievement",
                    "Security",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "id": "0E0SOsYepUfpCxadILURniSMpnorzEl3",
            "post_id": "9uupsy",
            "right": 18,
            "wrong": 30,
            "portrait_id": 1029
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for not wanting a part in my child's life?",
            "text": "7 years ago I impregnated my girlfriend at the time. I have never wanted children in my life so I offered to pay for an abortion. She wanted to have the child. We stayed together for about 4 months after that and then we broke up. I offered to pay for child support and we got something settled through the courts. Never missed a payment since then.\n\nSince then I have had no contact with our daughter and have not been interested in it. The closest I have to a relationship with her is sending her a gift for her birthday through her mother with instructions that it's from her and not someone else. About 3 days ago I got a call from my ex that she would like the to meet our daughter. I told her I'm not interested and to please not contact me about that again.\n\nFrankly I don't know if the kid is the one that put my ex to it by asking about me or if my ex is the one trying to arrange it."
        },
        "statistics": {
            "word_count": 180,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Conformity",
                    "Benevolence",
                    "Universalism",
                    "Security",
                    "Tradition"
                ]
            }
        },
        "extra": {
            "id": "VV6YZtIX36PblVDIQpeINLrn37Vgaopj",
            "post_id": "b0xbyd",
            "right": 104,
            "wrong": 103,
            "portrait_id": 1031
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for letting my boyfriend's passport expire before our trip?",
            "text": "My boyfriend of over a year and I are going to an out of country destination for a week in March. I love him a lot but he can be juvenile and I find myself feeling at times likes a mother and child dynamic.\n\nHis passport has been expired since May 2018, and I have brought it up several times to get it renewed. We have even had a tiff or two over it. In November, we booked and paid for this trip. It cost about 1000$ each. \n\nThe deadline of him needing to have his passport sent off so he can get it back in time is approaching quickly. I guess I'm asking preemptively to this so I know if I'd be an asshole if I followed through with what I am currently intending on doing : I'm not going to say shit and let him deal with the consequences if he doesn't get it together on time. I'll have a lovely vacation on my own. \n\nBe honest. Would that make me an asshole to knowingly let him miss out on our trip?"
        },
        "statistics": {
            "word_count": 184,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "id": "CT06H6oKPA9T3OqY92Gfr7uuU8L0zYyX",
            "post_id": "adwdkn",
            "right": 199,
            "wrong": 111,
            "portrait_id": 1032
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for not allowing my children to eat junk food, watch tv, or play video games?",
            "text": "I have two children a 7 year old son and a 9 year old girl. We don’t allow our children to eat junk food, they will sometimes have it if they go to a friends house or on special occasions like Christmas,  but we have zero junk food in our house normally. They sometimes beg me to buy it but normally they’re fine with what they have. We also don’t allow them to watch tv. We do allow them to watch an age appropriate movie at the weekend. And we don’t allow video games because I find absolutely nothing educational about them. Son has started asking to play but we’ve just said no. \n\nBoth our children are happy most the time, they do lots of extracurricular activities, sport/theatre stuff, we teach them how to cook, we play games, we read, they go out on their bikes, play with our dog, listen to music, learn life skills. Both of them are top of their class at school and we are always complimented on how polite and well behaved our children are. \n\nSometimes I feel I’m being a little bit harsh on them by restricting them from this stuff, but I also think this stuff is addictive and poisons their minds. Other family members and friends have told us we are way too strict, but Our kids know far more actual life skills than their peers. So AITA for the way I raise my children? "
        },
        "statistics": {
            "word_count": 243,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Conformity",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "id": "iuEFDO2mKteqnK4TQhAhIitjeci8ZWOw",
            "post_id": "b9zlaf",
            "right": 18,
            "wrong": 40,
            "portrait_id": 1035
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for asking her not to drink?",
            "text": "I grew up with an abusive alcoholic mother.   It was hell and as a result I don’t drink at all and don’t like being around drunk people.  \n\nWhen I started dating my girlfriend I knew that she drank and discussed my issues with it.  I just asked her that she doesn’t drink around me.  It worked out fine, she was great about not even drunk dialing me, a problem I had with my ex girlfriend.  \n\nWhen we started discussing moving in I was very apprehensive about it.  I asked her if she could really handle not drinking at all in our home and she was adamant that it was no big deal.  That if she wanted to drink she could just spend that night at a friends and that she really didn’t drink that often anyways so it wouldn’t be a problem.  \n\nThe first few months that’s exactly what happened.  Since then though there have been times that she’s come home obviously drunk and just lying about it to me.  I’ve talked her about it to mixed reactions.  Sometimes she will apologize profusely and promise not to let it happen again.   Other times it becomes an argument about how I’m projecting my mother’s problem on our situation.  That she’s not an alcoholic or abusive.  Which is true, but it’s not really about her being abusive, it’s that being around drunk people drudges up a lot of painful memories for me.  She just brushed that off though.  \n\nAfter this last time it happened she’s outright fighting me on the issue.   She says this is her home too and we’re both adults.   That I need to get therapy instead of trying to control her.  We had a clear agreement before we moved in though.  "
        },
        "statistics": {
            "word_count": 292,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Benevolence",
                    "Security",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "E6h6Kd6BVNuuFuqRLpkISLB6v9rVv8sl",
            "post_id": "b3d9sr",
            "right": 137,
            "wrong": 112,
            "portrait_id": 1038
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITAH for asking a religious friend to refrain from praying for my family member?",
            "text": "So today i had told 2 of my colleagues (who i regard as friends) that we discovered that my family member (a very very close one) has cancer, and that the situation is very bad. They were both very nice and offered emotional support which was much appreciated. Later during the day, one of the two, who is a very religious Jewish man, texted me the following:\n\nHim: \"hey, can you tell me {my famaly member's} full name so i can pray for him?\"\n\nMe: \"please don't :)\"\n\nMe: \"but i appreciate the sentiment\"\n\nHim \"you're welcome\"\n\nTo give context, I'm an atheist, and i am very much against these kinds of things (and so is the mentioned family member tbh) . He knows it about me, and we are very respectful to each other's beliefs or lack thereof. We didn't talk about it anymore but had some small talk after it and it doesn't seem to have bothered him, but i can't really know for sure.\n\nWas i the asshole? Could i have maybe handled it better? "
        },
        "statistics": {
            "word_count": 178,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Conformity",
                    "Tradition",
                    "Benevolence",
                    "Universalism",
                    "Security"
                ]
            }
        },
        "extra": {
            "id": "2F2A8VkNail7mOM5UCY6swA7OFanpWKt",
            "post_id": "a7mb4x",
            "right": 15,
            "wrong": 16,
            "portrait_id": 1039
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for saying my husband absolutely can't get a motorcycle?",
            "text": "Throwaway in case he sees this. He may anyways but I'll deal with that if it happens.\n\nHusband is 34, smartest guy I know academically but common sense challenged. He's a geologist for a major oil company and works very, very hard and makes a good living. But we have had to live in some real shit holes over the years (like SA, where I really didn't leave our company compound for 2 years). We are back in the LA area and he thinks now we have \"open roads\" (the 405...what?) he wants a motorcycle. \n\nI am dead against it. They are too dangerous, it probably won't get used, it's a bad example for the kids, it looks super douche-bro, and I think he'll move onto his next hobby and forget about it.\n\nWe aren't getting divorced over this or anything but our opposing stances are causing major friction. Am I the asshole?"
        },
        "statistics": {
            "word_count": 153,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Security",
                    "Conformity",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "js3YrgsYrvt1aL0OqIlhKOqMJ3ASZSbF",
            "post_id": "b9qnuy",
            "right": 15,
            "wrong": 19,
            "portrait_id": 1043
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for being hurt by my daughter's name change",
            "text": "My wife kept her last name when we married, but we gave my last name to our children. My daughter changed her name to her husband's when she got married. They are now in the process of a divorce.\n\nMy daughter mentioned today that she wants to change her last name not back to my name, but to her mother's name. She wants to honor everything my wife has done for her.\n\nI'm a little hurt by this and told her so. She's free to do as she pleases, but the presentation of it all just makes it feel like she values her mother's contribution over mine. AITA?"
        },
        "statistics": {
            "word_count": 108,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Benevolence",
                    "Tradition",
                    "Achievement",
                    "Conformity"
                ]
            }
        },
        "extra": {
            "id": "CKCPuxIF281zjd1eiXNeFg0Kp74mCK62",
            "post_id": "atz05z",
            "right": 32,
            "wrong": 24,
            "portrait_id": 1046
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for not taking a video game seriously?",
            "text": "One of my classmates at school has been begging me to play overwatch with him since he learned I recently bought it. I agree to play with him and I tell him I’m decent but I’m not the greatest. We start playing and he tells me we don’t have a healer so he tells me to be the healer. Support is what I’m best at and what he’s worst at but I don’t like playing support so I pick some ninja guy who I thought looked cool. He gets really annoyed and says that our team is going to lose as nobody else is picking support. He caves in and plays as a support class and does really bad with it. He tells me to switch to support because I’m doing bad with my character, he’s doing bad as our support and our team is losing. I don’t have fun playing as support so I just keep trying out different characters.  My girlfriend is also with me so I let her play while I go bathroom. She’s even worse than I am and by the time I get back my team has already lost the game. He’s pretty mad and I think he’s rank went down or something. In my opinion the point of games is to have fun and I don’t have fun when people are telling me how I should playing. It’s just a game and I think he took the whole thing too seriously "
        },
        "statistics": {
            "word_count": 247,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 4,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Achievement",
                    "Conformity"
                ]
            }
        },
        "extra": {
            "id": "PeaY2ulMXx3u9aXgnQQ8evXnZMYAJKDe",
            "post_id": "awvnqu",
            "right": 29,
            "wrong": 16,
            "portrait_id": 1050
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for yelling at my mom for giving my baby a ”comfort” bottle?",
            "text": "My mom is retired and watches my daughter (18 months) for me while I’m at work. I do appreciate it a lot and she never wants money. The thing is, I don’t always feel like she fully takes me seriously as a parent. I’m single and I struggled a bit in the beginning and I’m not sure my mom ever fully let that go. \n\nHere’s what happened this time. I tried very hard to wean my daughter off of the bottle when she was a year old and communicated with my mother a lot about the switch to sippy cups. \n\nI came home early the other day because of a huge power outage at my job. I see my daughter on the couch happily sucking her bottle. I confronted my mother about it who said she only gives it to her “when she gets hysterical”. I flipped out and I did raise my voice. \n\nWhat’s super annoying is that I know my daughter is smart enough to know what’s going on too since she never even cries to me for one. So basically it’s been their little secret. \n\nAnyway my mom is now mad at me and barely speaking to me. But I feel like anyone would have been angry in my position? AITA for how I reacted?"
        },
        "statistics": {
            "word_count": 218,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Achievement",
                    "Power",
                    "Conformity",
                    "Tradition",
                    "Benevolence"
                ]
            }
        },
        "extra": {
            "id": "Wt7j3ZJZxa6pGkuyuNB6sMEMaEKsCSSv",
            "post_id": "a5vucx",
            "right": 14,
            "wrong": 17,
            "portrait_id": 1053
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for not wanting to take my girlfriend to the cinema?",
            "text": "Every week my friend and I go to the cinema to see the latest film, we have done this for years. Recently though whenever there is a big block buster my girlfriend insists on coming along. I've said to her that I am happy to see a film again on the weekend as it gives me a chance to catch some parts I may have missed. She doesn't want to do that though and immediately gets annoyed by me not wanting to take her and thinks I'm embarrassed to introduce them together. They've met multiple times and there is no problem there.\n\nUsually though the cinema is a chance to have a chat with one of my oldest friends about life and problems and it's easier for both of us to do that if she is not there. She doesn't seem to understand that though even after explanation. "
        },
        "statistics": {
            "word_count": 148,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 6,
                "relevant_values": [
                    "Self-Direction",
                    "Stimulation",
                    "Hedonism",
                    "Achievement",
                    "Benevolence",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "j8Aunini55IquygZgVxnR768hlwJP0XZ",
            "post_id": "9x8l8g",
            "right": 23,
            "wrong": 10,
            "portrait_id": 1057
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for telling my wife I was away for a business trip, when really I went on a city break on my own?",
            "text": "I love my wife but she is awful to travel with. She's a bit of a princess and she doesn't care about art or architecture. She wears stupid shoes and walks too slow, but gets tired of places too fast.\n\nI did originally have a meeting in London but it got cancelled and I still wanted to go, so I booked myself into a fancy hotel, went to galleries, rode the subway and ate in amazing restaurants for three nights. Aw man it was awesome. I just enjoyed not caring about her being entertained and being alone to my thoughts.\n\nI just kept thinking the whole time I was there how she wouldn't have liked it, and would have ruined it. If I'd have told her about it she would have come with me, no question. \n\nAm I an asshole?"
        },
        "statistics": {
            "word_count": 140,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Achievement",
                    "Benevolence",
                    "Conformity",
                    "Universalism"
                ]
            }
        },
        "extra": {
            "id": "R1Ja7gtEZn8QpTwSApNDrLGcr6I28tnW",
            "post_id": "b3bmbu",
            "right": 167,
            "wrong": 324,
            "portrait_id": 1059
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA (or we, wife and I) for buying a house in an underserved Hispanic community?",
            "text": "Will keep this very short but can add INFO if needed. Wife and I came into some nice inheritance in mid 2018. We decided that we are going to use the money to see the world and live in exotic places while trying to get our dream careers going (me: writer, she: clothing designer). We also wanted to live in underserved communities where we could be around real people instead of the Dallas suburbs we grew up in or in gentrified SoHo where we moved from.\n\n\nWe decided on South Tucson, AZ. It is 90% Hispanic, historic and gorgeous. We were able to buy a house for a song and we eagerly moved in 2 weeks ago. However the reception has not been good. At first we figured that maybe we were the first open lesbian couple they had seen so we went around and introduced ourself last week and people were either not friendly and our 65 year old neighbor told us that white people like us only bring problems to the neighborhood. We asked her to explain, she said if she has to explain then we truly don’t get it. \n\nI don’t think we are assholes but I sure felt like it  after speaking with our neighbor. We are just trying to experience a different culture...I thought that was a good thing.\n"
        },
        "statistics": {
            "word_count": 224,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Self-Direction",
                    "Conformity",
                    "Benevolence",
                    "Universalism",
                    "Tradition"
                ]
            }
        },
        "extra": {
            "id": "dqv0ryxaJFijIr9xNlKKqTlv4WaYeK8q",
            "post_id": "akrtu7",
            "right": 23,
            "wrong": 28,
            "portrait_id": 1061
        }
    },
    {
        "data_source": "Reddit",
        "content": {
            "title": "AITA for not feeding everyone else",
            "text": "I am a mom of two teenagers and one preteen. Most of you know that means they eat like crazy and I'm cooking a lot. My son has a friend Chris who isn't too well off. Chris comes over quite a bit and I am happy to feed one more mouth.\n\nLast week his parents and two siblings came over to pick him up. All of them were on the doorstep. One of the siblings needed to use the bathroom and as they went in my house they commented on how nice everything was and how great the food smells. As they were waiting one sibling commented on hungry they were. \n\nI diplomatically said that \"well I'm sure you parents have a nice dinner planned for you\" as I definitely had not cooked for another four people to join us. \n\nThe father replied \"not really\" and looked away. \n\nI said \"well take out it is then.. perhaps you should get moving since the kids are hungry.\" and ushered them to the door.\n\nSince then I've told my son that he may be better off meeting Chris and hanging out elsewhere rather than bringing him home so much (four visits to one per week) or even going to his place as I don't want a repeat of Chris' family here on my doorstep. \n\nI feel like I did the right thing by my family and yet I feel like an asshole. It's not Chris' fault they're poor but at the same time I don't appreciate an extra four last minute guests."
        },
        "statistics": {
            "word_count": 260,
            "is_harmful": false,
            "analysis": {
                "number_of_distinct_value_based_responses": 5,
                "relevant_values": [
                    "Benevolence",
                    "Universalism",
                    "Security",
                    "Conformity",
                    "Achievement"
                ]
            }
        },
        "extra": {
            "id": "2QRDw2fS0YYnvvBQOelzrHUEUHz3pjC7",
            "post_id": "azbqau",
            "right": 85,
            "wrong": 60,
            "portrait_id": 1066
        }
    }
]